{
    "CS 1100": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Small group discussions with first year students are led by one or more faculty members and include a variety of foundational, motivational, and topical subjects for computationalist.",
        "prereqs": "",
        "title": "Freshman Leap Seminar"
    },
    "CS 1171": {
        "category": "Modeling & Simulation",
        "credit": 1.0,
        "description": "For students with a solid introductory computing background needing to demonstrate proficiency in the MATLAB language.",
        "prereqs": "Undergraduate Semester level CS 1301 Minimum Grade of D or Undergraduate Semester level CS 15XX Minimum Grade of D or Undergraduate Semester level CS 13X1 Minimum Grade of D or Undergraduate Semester level CS 1315 Minimum Grade of D",
        "title": "Computing in MATLAB"
    },
    "CS 1301": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Introduction to computing principles and programming practices with an emphasis on the design, construction and implementation of problem solutions use of software tools.",
        "prereqs": "",
        "title": "Intro to Computing"
    },
    "CS 1301R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 1301",
        "prereqs": "",
        "title": "CS 1301 Recitation"
    },
    "CS 1315": {
        "category": "Media",
        "credit": 3.0,
        "description": "Introduction to computation (algorithmic thinking, data structures, data transformation and processing, and programming) in a media and communication context. Credit not awarded for both CS 4452 and CS 1315.",
        "prereqs": "",
        "title": "Intro Media Computation"
    },
    "CS 1315R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 1315",
        "prereqs": "",
        "title": "CS 1315 Recitation"
    },
    "CS 1316": {
        "category": "Media",
        "credit": 3.0,
        "description": "Modeling the structure of media (e.g., music, graphical scenes) using dynamic data structures. Designing objects as encapsulations of structure and behavior. Algorithms for simulating objects. May not be taken for credit by students who have credit for CS 1322.",
        "prereqs": "Undergraduate Semester level CS 1301 Minimum Grade of D or Undergraduate Semester level CS 1315 Minimum Grade of D or Undergraduate Semester level CS 1371 Minimum Grade of D",
        "title": "Rep Structure & Behavior"
    },
    "CS 1331": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Introduction to techniques and methods of object-oriented programming such an encapsulation, inheritance, and polymorphism. Emphasis on software development and individual programming skills.",
        "prereqs": "Undergraduate Semester level CS 1301 Minimum Grade of C or Undergraduate Semester level CS 1315 Minimum Grade of C or Undergraduate Semester level CS 1321 Minimum Grade of C or Undergraduate Semester level CS 1371 Minimum Grade of C",
        "title": "Intro-Object Orient Prog"
    },
    "CS 1331R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 1331",
        "prereqs": "",
        "title": "CS 1331 Recitation"
    },
    "CS 1332": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Computer data structures and algorithms in the context of object-oriented programming. Focus on software development towards applications.",
        "prereqs": "Undergraduate Semester level CS 1322 Minimum Grade of C or Undergraduate Semester level CS 1331 Minimum Grade of C",
        "title": "Data Struct & Algorithms"
    },
    "CS 1332R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 1332",
        "prereqs": "",
        "title": "CS 1332 Recitation"
    },
    "CS 1371": {
        "category": "Modeling & Simulation",
        "credit": 3.0,
        "description": "Foundations of computing with an introduction to design and analysis of algorithms and an introduction to design and construction of programs for engineering problem-solving.",
        "prereqs": "",
        "title": "Computing for Engineers"
    },
    "CS 1371R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 1371",
        "prereqs": "",
        "title": "CS 1371 Recitation"
    },
    "CS 1372": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Design, analysis and implementation of programs for engineering problem-solving using ANSI Standard C, with an introduction to C++.",
        "prereqs": "Undergraduate Semester level CS 1171 Minimum Grade of D or Undergraduate Semester level CS 1371 Minimum Grade of C or Undergraduate Semester level CS 1301 Minimum Grade of C",
        "title": "Program Design for Engrs"
    },
    "CS 1801": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 1802": {
        "category": "Miscellaneous",
        "credit": 2.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 1803": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 1804": {
        "category": "Miscellaneous",
        "credit": 4.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 1805": {
        "category": "Miscellaneous",
        "credit": 5.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 1XXX": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "",
        "prereqs": "",
        "title": "Computer Sci Elective"
    },
    "CS 2050": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Proof methods, strategy, correctness of algorithms over discrete structures. Induction and recursion. Complexity and order of growth. Number theoretic principles and algorithms. Counting and computability. Credit not allowed for both CS 2050 and CS 2051.",
        "prereqs": "",
        "title": "Intro Discrete Math CS"
    },
    "CS 2050R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 2050",
        "prereqs": "",
        "title": "CS 2050 Recitation"
    },
    "CS 2051": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Proof methods, strategy, correctness of algorithms over discrete structures. Induction and recursion. Complexity and order of growth. Number theoretic principles and algorithms. Counting and computability. Credit not allowed for both CS 2051 and CS 2050.",
        "prereqs": "",
        "title": "Honors Discrete Math CS"
    },
    "CS 2110": {
        "category": "Systems & Architecture",
        "credit": 0.0,
        "description": "An introduction to basic computer hardware, machine language, assembly language, and C programming.",
        "prereqs": "Undergraduate Semester level CS 1331 Minimum Grade of C",
        "title": "Computer Organiz&Program"
    },
    "CS 2200": {
        "category": "Systems & Architecture",
        "credit": 0.0,
        "description": "A broad exposure to computer system structure and networking including software abstractions in operating systems for orchestrating the usage of the computing resources.",
        "prereqs": "Undergraduate Semester level CS 2110 Minimum Grade of C or (Undergraduate Semester level ECE 2020 Minimum Grade of C and Undergraduate Semester level ECE 2035 Minimum Grade of C)",
        "title": "Systems and Networks"
    },
    "CS 2261": {
        "category": "Media",
        "credit": 0.0,
        "description": "Controlling the interface between hardware and software in media devices. Machine-level programming (e.g., in C) to create graphics, generate sound, and support user interaction.",
        "prereqs": "Undergraduate Semester level CS 1331 Minimum Grade of C",
        "title": "Media Device Architectur"
    },
    "CS 2316": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Reading, manipulating, and exporting data for engineering, business, and scientific applications. Covers GUI's, File I/O, basic SQL, and web scraping. Emphasis on software development.",
        "prereqs": "Undergraduate Semester level CS 1371 Minimum Grade of D or Undergraduate Semester level CS 1301 Minimum Grade of D or Undergraduate Semester level CS 1315 Minimum Grade of D",
        "title": "Data Input/Manipulation"
    },
    "CS 2316R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 2316",
        "prereqs": "",
        "title": "CS 2316 Recitation"
    },
    "CS 2335": {
        "category": "Systems & Architecture",
        "credit": 0.0,
        "description": "Methods for solving large programming problems. Techniques for quality assurance, managing programs, working in teams, analyzing problems, and producing effective solutions.",
        "prereqs": "Undergraduate Semester level CS 1332 Minimum Grade of C",
        "title": "Software Practicum"
    },
    "CS 2340": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Object-oriented programming methods for dealing with large programs. Focus on quality processes, effective debugging techniques, and testing to assure a quality product.",
        "prereqs": "Undergraduate Semester level CS 1331 Minimum Grade of C or Undergraduate Semester level CS 1372 Minimum Grade of C or Undergraduate Semester level CS 1316 Minimum Grade of C",
        "title": "Objects and Design"
    },
    "CS 2345": {
        "category": "Systems & Architecture",
        "credit": 0.0,
        "description": "This course presents important programming principles that should be considered when using a non-automatic memory management complex language (such as C++). Templating, generic programming, resource acquisition is initialization (RAII), and smart pointers are a few examples. Credit not awarded for both CS 2345 and ECE 2036.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C and ( (Undergraduate Semester level CS 2110 Minimum Grade of C or Undergraduate Semester level CS 2261 Minimum Grade of C) or (Undergraduate Semester level ECE 2020 Minimum Grade of C and Undergraduate Semester level ECE 2035 Minimum Grade of C) )",
        "title": "Adv Practical O-O Prog"
    },
    "CS 2600": {
        "category": "Theory",
        "credit": 0.0,
        "description": "Introduction to the representation and manipulation of complex symbolic and sub-symbolic information.",
        "prereqs": "Undergraduate Semester level CS 1301 Minimum Grade of C or Undergraduate Semester level CS 1315 Minimum Grade of C or Undergraduate Semester level CS 1371 Minimum Grade of C",
        "title": "Knowledge Rep & Process"
    },
    "CS 2698": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Independent research conducted under the guidance of a faculty member.",
        "prereqs": "",
        "title": "Research Assistantship"
    },
    "CS 2699": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Independent research conducted under the guidance of a faculty member.",
        "prereqs": "",
        "title": "Undergraduate Research"
    },
    "CS 2701": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Elements of technology venture creation including opportunity identification and validation, ideation, customer discovery, markey analysis, minimum viable product development, business models, intellectual property, and capital raises. Cross-listed with COE 2701.",
        "prereqs": "",
        "title": "Startup Lab"
    },
    "CS 2701R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 2701",
        "prereqs": "",
        "title": "CS 2701 Recitation"
    },
    "CS 2801": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 2802": {
        "category": "Miscellaneous",
        "credit": 2.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 2803": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 2804": {
        "category": "Miscellaneous",
        "credit": 4.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 2805": {
        "category": "Miscellaneous",
        "credit": 5.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 2XXX": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "",
        "prereqs": "",
        "title": "Computer Sci Elective"
    },
    "CS 3001": {
        "category": "People",
        "credit": 0.0,
        "description": "Examines the role and impact of information and communication technology in society, with emphasis on ethical, professional, and public policy issues.",
        "prereqs": "",
        "title": "Computing & Society"
    },
    "CS 3101": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Students will learn how computer-science-based ventures are developed. The course is project-based. Students propose, analylze, pitch, design, implement, package and market web-2.0 and virtual-world-based products and services.",
        "prereqs": "Undergraduate Semester level CS 1301 Minimum Grade of C or Undergraduate Semester level CS 1315 Minimum Grade of C or Undergraduate Semester level CS 1371 Minimum Grade of C",
        "title": "Comp Sci Ventures"
    },
    "CS 3210": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Operating systems concepts, including multi-threading, scheduling, synchronization, communication, and access control. Projects will cover design and implementation of several operating systems components.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C",
        "title": "Design-Operating Systems"
    },
    "CS 3220": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Principles in pipelined processor design, with emphasis on the need for a close interaction between code generation and architecture.",
        "prereqs": "(Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C) and Undergraduate Semester level ECE 2031 Minimum Grade of C",
        "title": "Processor Design"
    },
    "CS 3240": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Interpreters as abstract machines and the tools used to construct them, such as scanners and parsers. An introduction to models of computation as embodied by different programming languages. Limits of and relationships between these models.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C",
        "title": "Languages and Computation"
    },
    "CS 3251": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Introduction to problems in computer networking, including error recovery, medium access, routing, flow control, and transport. Emphasis on current best practice. Includes programming of networked applications.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C",
        "title": "Computer Networking I"
    },
    "CS 3300": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Team-based project class to introduce and apply software engineering principles and practices.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C",
        "title": "Intro to Software Engr"
    },
    "CS 3311": {
        "category": "Systems & Architecture",
        "credit": 1.0,
        "description": "Part 1 of a 2 semester project design and implementation sequence conjoined with Technical Communications. Prepare requirements, design and project plans. Develop a basic prototype of the desired system. Project is completed in CS 3312-Project Implementation. Credit will not be awared for CS 3311 and CS 4911.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C",
        "title": "Project Design"
    },
    "CS 3312": {
        "category": "Systems & Architecture",
        "credit": 2.0,
        "description": "The second part of a 2 semester project design and implementation sequence conjoined with Technical Communications. Implement a project designed in CS 3311. Credit will not be awarded for CS 3312 and CS 4911.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C and Undergraduate Semester level LMC 3432 Minimum Grade of C",
        "title": "Project Implementation"
    },
    "CS 3451": {
        "category": "Media",
        "credit": 3.0,
        "description": "Geometric constuctions; transformations; perception; reflection models; photorealistic; non-photorealistic, and image-based rendering; rendering software and API's; triangle-mesh processing; graphic acceleration; user-interaction, design and animation.",
        "prereqs": "(Undergraduate Semester level MATH 2605 Minimum Grade of D or Undergraduate Semester level MATH 2401 Minimum Grade of D or Undergraduate Semester level MATH 2411 Minimum Grade of D or Undergraduate Semester level MATH 24X1 Minimum Grade of T or Undergraduate Semester level MATH 2551 Minimum Grade of D or Undergraduate Semester level MATH 2550 Minimum Grade of D or Undergraduate Semester level MATH 2561 Minimum Grade of D or Undergraduate Semester level MATH 2X51 Minimum Grade of T) and ( (Undergraduate Semester level CS 2110 Minimum Grade of C or Undergraduate Semester level CS 2261 Minimum Grade of C) or (Undergraduate Semester level ECE 2020 Minimum Grade of C and Undergraduate Semester level ECE 2035 Minimum Grade of C) ) and (Undergraduate Semester level CS 1332 Minimum Grade of C and Undergraduate Semester level CS 2340 Minimum Grade of C)",
        "title": "Computer Graphics"
    },
    "CS 3510": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Basic techniques of design and analysis of efficient algorithms for standard computational problems. NP-Completeness. Credit not allowed for both CS 3510 and CS 3511.",
        "prereqs": "(Undergraduate Semester level CS 2050 Minimum Grade of C or Undergraduate Semester level CS 2051 Minimum Grade of C or Undergraduate Semester level MATH 2106 Minimum Grade of C) and Undergraduate Semester level CS 1332 Minimum Grade of C",
        "title": "Dsgn&Analysis-Algorithms"
    },
    "CS 3511": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Techniques of design and analysis of efficient algorithms for standard computational problems. NP-Completeness Project. Credit not allowed for both CS 3511 and CS 3510.",
        "prereqs": "(Undergraduate Semester level CS 2050 Minimum Grade of C or Undergraduate Semester level CS 2051 Minimum Grade of C or Undergraduate Semester level MATH 2106 Minimum Grade of C) and Undergraduate Semester level CS 1332 Minimum Grade of C or (Undergraduate Semester level MATH 3012 Minimum Grade of D or Undergraduate Semester level MATH 3022 Minimum Grade of D)",
        "title": "Algorithms Honors"
    },
    "CS 3600": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "An introduction to artificial intelligence and machine learning. Topics include intelligent system design methodologies, search and problem solving, supervised and reinforced learning.",
        "prereqs": "Undergraduate Semester level CS 1332 Minimum Grade of C",
        "title": "Intro-Artificial Intell"
    },
    "CS 3630": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Covers fundamental problems and leading solutions for computer and robot perception and action from the point of view of autonomous robot navigation.",
        "prereqs": "Undergraduate Semester level CS 1332 Minimum Grade of C",
        "title": "Intro-Perception&Robotic"
    },
    "CS 3651": {
        "category": "Devices",
        "credit": 0.0,
        "description": "Hands-on course teaching the fundamentals of electronics of electrical and mechanical prototyping.",
        "prereqs": "Undergraduate Semester level ECE 2031 Minimum Grade of C",
        "title": "Prototyping Intelligent Device"
    },
    "CS 3651R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 3651",
        "prereqs": "",
        "title": "CS 3651 Recitation"
    },
    "CS 3743": {
        "category": "Devices",
        "credit": 3.0,
        "description": "Analysis of emerging technologies and their impacts for firm practice, market practice, policy, and society. Credit not allowed for both CS 3743 and MGT 3743 or ME 3743.",
        "prereqs": "",
        "title": "Emerging Technologies"
    },
    "CS 3744": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Analysis of the managerial challenges of the product development process.",
        "prereqs": "",
        "title": "Mangn Prod Serv Tech Dev"
    },
    "CS 3750": {
        "category": "People",
        "credit": 3.0,
        "description": "Human computer interface is considered in terms of user-system compatibility. Concepts in human factors and interface design are covered in relation to capabilities of both humans and computers. Crosslisted with PSYC 3750.",
        "prereqs": "",
        "title": "User Interface Design"
    },
    "CS 3790": {
        "category": "People",
        "credit": 3.0,
        "description": "Multidisciplinary perspectives on cognitive science. Interdisciplinary approaches to issues in cognition, including memory, language, problem solving, learning, perception, and action. Crosslisted with PST, PSYC, and ISYE 3790.",
        "prereqs": "",
        "title": "Intro-Cognitive Science"
    },
    "CS 3801": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 3802": {
        "category": "Miscellaneous",
        "credit": 2.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 3803": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 3804": {
        "category": "Miscellaneous",
        "credit": 4.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 3805": {
        "category": "Miscellaneous",
        "credit": 5.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 3873": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Special Topics in Computer Science",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 3XXX": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "",
        "prereqs": "",
        "title": "Computer Sci"
    },
    "CS 4001": {
        "category": "People",
        "credit": 3.0,
        "description": "Examines the role and impact of information and communication technology in society, with emphasis on ethical, professional, and public policy issues. Credit not allowed for both CS 4001 and 4002.",
        "prereqs": "",
        "title": "Computing & Society"
    },
    "CS 4002": {
        "category": "People",
        "credit": 3.0,
        "description": "Examines the role and impact of robotics, distributed sensing and actuation, ubiquitous computing and related technology in society, emphasizing ethical, professional and public policy issues. Credit not allowed for both CS 4001 and 4002",
        "prereqs": "",
        "title": "Robots and Society"
    },
    "CS 4003": {
        "category": "People",
        "credit": 3.0,
        "description": "This course covers various Artificial Intelligence and bias mitigation techniques that can be used to counterbalance the potential misuse and abuse of learning from data.",
        "prereqs": "",
        "title": "AI Ethics and Society"
    },
    "CS 4005": {
        "category": "Devices",
        "credit": 3.0,
        "description": "Students will explore new paradigms in how content is created, distributed, and consumed, with hands-on demos of next-generation computing technologies.",
        "prereqs": "Undergraduate Semester level CS 2316 Minimum Grade of D",
        "title": "Next Gen Computing Tech"
    },
    "CS 4010": {
        "category": "People",
        "credit": 3.0,
        "description": "Provides an introduction to copyrights, patents, trade secrets, trademarks, and commercial law pertaining to computer software and hardware.",
        "prereqs": "",
        "title": "Intro to Computer Law"
    },
    "CS 4052": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "An introductory course on the development life cycle of business information systems. It covers analysis and design tools and methodology. Credit not allowed for both CS 4052 and MGT 4045.",
        "prereqs": "",
        "title": "Systems Analysis& Design"
    },
    "CS 4057": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Business processes are the mechanisms by which work is organized and performed. This course covers the analysis of business technology. Credit will not be awarded for both CS 4057 and MGT 4057.",
        "prereqs": "Undergraduate Semester level MGT 2200 Minimum Grade of D",
        "title": "Bus Process Analy&Design"
    },
    "CS 4210": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Operating system abstractions and their implementations, multi-threading, efficient inter-address communication, high-level synchronization, introduction to multi-processor and distributed operating systems, real-time systems. Credit is not awarded for both CS 4210 and CS 6210.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of C",
        "title": "Adv Operating Systems"
    },
    "CS 4220": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Design principles, programming techniques, and case studies of embedded real-time systems. Interface techniques and devices. Representations and reasoning about physical processes.Credit not awarded for both CS 4220 and CS 6235.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C",
        "title": "Embedded Systems"
    },
    "CS 4220R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Recitation for CS 4220",
        "prereqs": "",
        "title": "CS 4220 Recitation"
    },
    "CS 4233": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "The objective of this course is to develop an in-depth understanding of the design, implementation, and evaluation of modern parallel computers. Credit not allowed for both CS 4233 and CS 7110.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of C",
        "title": "Parallel Comp Arch"
    },
    "CS 4235": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Terms/concepts, threats, controls; problem definition; comprehensive information security model; security for operating systems, databases, network/distributed systems; administering security; legal/ethical/policy issues. Credit not allowed for both CS 4235 and CS 6035.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C",
        "title": "Intro to Info Security"
    },
    "CS 4237": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Fundamental concepts and principles of computer security, operating system and database security, secret key and public key cryptographic algorithms, hash functions, authentication, firewalls and intrusion detection systems, IPSec ad VPN, and wireless security.",
        "prereqs": "Undergraduate Semester level CS 3251 Minimum Grade of C",
        "title": "Comp & Network Security"
    },
    "CS 4240": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Study of techniques for the design and implementation of compilers, interpreters, and program analyzers, with consideration of the particular characteristics of widely used programming languages.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C",
        "title": "Compilers & Interpreters"
    },
    "CS 4245": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Computational techniques for analysis of large, complex datasets, covering fundamental aspects as well as modern data mining and analysis techniques. Cross-listed with ISYE 4245.",
        "prereqs": "(Undergraduate Semester level MATH 2605 Minimum Grade of D or Undergraduate Semester level MATH 2401 Minimum Grade of D or Undergraduate Semester level MATH 2411 Minimum Grade of D or Undergraduate Semester level MATH 24X1 Minimum Grade of D) and (Undergraduate Semester level CS 1332 Minimum Grade of C or Undergraduate Semester level CS 1372 Minimum Grade of C)",
        "title": "Intro Data Mining & Anal"
    },
    "CS 4251": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Principles of computer networks, including medium access, ARQ protocols, routing, congestion avoidance, and control. Emphasis on design options and tradeoffs. Includes significant network application programming.",
        "prereqs": "Undergraduate Semester level CS 3251 Minimum Grade of C",
        "title": "Computer Networking II"
    },
    "CS 4255": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Introduction to SNMP-based network management. Practical application to network and system management including hands-on lab practice.",
        "prereqs": "Undergraduate Semester level CS 3251 Minimum Grade of C",
        "title": "Intro-Network Management"
    },
    "CS 4260": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Study of telecommunication systems emphasizing functional roles of the various portions of the system and how various functional components support and interact with one another.",
        "prereqs": "(Undergraduate Semester level MATH 3215 Minimum Grade of D or Undergraduate Semester level MATH 3225 Minimum Grade of D or Undergraduate Semester level MATH 3770 Minimum Grade of D or Undergraduate Semester level ISYE 3770 Minimum Grade of D or Undergraduate Semester level CEE 3770 Minimum Grade of D or Undergraduate Semester level ISYE 2028 Minimum Grade of D or Undergraduate Semester level MATH 3670 Minimum Grade of D) and Undergraduate Semester level CS 2200 Minimum Grade of C",
        "title": "Telecommunications Sys"
    },
    "CS 4261": {
        "category": "Devices",
        "credit": 3.0,
        "description": "This course provides an introduction to mobile applications and services with an emphasis on voice and data service integration in modern commercial networks.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C",
        "title": "Mobile Apps & Svcs"
    },
    "CS 4270": {
        "category": "Info Internetworks",
        "credit": 0.0,
        "description": "Detailed study of the principles of data transmission systems and their performance, reinforced by laboratory exercises.",
        "prereqs": "Undergraduate Semester level CS 3251 Minimum Grade of C",
        "title": "Data Communications Lab"
    },
    "CS 4280": {
        "category": "People",
        "credit": 3.0,
        "description": "Overview of telecommunication regulation at the federal, state, and judicial levels; review of FCC policies and restrictions on Bell operating companies under the AT&T Consent Agreement.",
        "prereqs": "",
        "title": "Survey-Telecom & the Law"
    },
    "CS 4290": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Topics concerning the hardware design of computer systems. Advanced techniques in high-performance pipelined central processing units. Memory and I/O systems. Parallel processors including shared-memory multiprocessors and cluster computers. Credit is not allowed for both CS 4290 and any of the following courses: CS 6290, ECE 4100, ECE 6100.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C",
        "title": "Advanced Computer Org"
    },
    "CS 4320": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "The course will provide students with an overall context in which software systems are developed from the viewpoint of processes that support development. Software engineering is described as the set of activities developers engage in to create high-quality products within schedule and budget constraints.",
        "prereqs": "Undergraduate Semester level CS 3300 Minimum Grade of C",
        "title": "Software Processes"
    },
    "CS 4330": {
        "category": "Systems & Architecture",
        "credit": 0.0,
        "description": "Software engineering methods specific to classes of applications or systems, including information systems and embedded, real-time systems.",
        "prereqs": "Undergraduate Semester level CS 3300 Minimum Grade of C",
        "title": "Software Applications"
    },
    "CS 4342": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Methods and principles for program generation, testing, and managing the evolution of software systems.",
        "prereqs": "Undergraduate Semester level CS 3300 Minimum Grade of C",
        "title": "Software Generation"
    },
    "CS 4365": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "A survey of basic software tools and techniques used in mission-critical systems and applications, combined with in-depth study of fundamental principles underlying enterprise computing. Credit not allowed for both 4365 and CS 6365.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of C or Undergraduate Semester level CS 4400 Minimum Grade of C",
        "title": "Intro Enterprise Comp"
    },
    "CS 4392": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Fundamentals of programming language design and theory. Topics include formal semantics and type systems for imperative, functional, and parallel languages; lambda calculus and its variants; the Curry-Howard Correspondence; techniques for proving language properties and verifying program specifications.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C",
        "title": "Programming Languages"
    },
    "CS 4400": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Comprehensive coverage of mainstream database concepts such as the entity-relationship model, relational databases, query languages, and database design methodology. Includes a project. Credit not allowed for both CS 4400 and CS 6402.",
        "prereqs": "Undergraduate Semester level CS 1301 Minimum Grade of D or Undergraduate Semester level CS 1315 Minimum Grade of D or Undergraduate Semester level CS 1371 Minimum Grade of D",
        "title": "Intr to Database Systems"
    },
    "CS 4420": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Study of fundamental software components/algorithms of a database system, including the file manager, query engine, lock manager, and recovery manager. Includes a project component. Credit not allowed for both CS 4420 and CS 6422.",
        "prereqs": "Undergraduate Semester level CS 4400 Minimum Grade of C",
        "title": "Database Sys Implement"
    },
    "CS 4432": {
        "category": "Systems & Architecture",
        "credit": 0.0,
        "description": "The analysis, design, and implementation of information systems. Topics include requirements analysis, design representations, implementation techniques, and evaluation of systems.",
        "prereqs": "Undergraduate Semester level CS 3300 Minimum Grade of C and Undergraduate Semester level CS 4400 Minimum Grade of C",
        "title": "Information Systems Dsgn"
    },
    "CS 4440": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "The course will cover current developments including distributed, object-oriented, temporal-spatial, Web-based, mobile, and active database technologies, and data warehousing and mining applications.",
        "prereqs": "Undergraduate Semester level CS 4400 Minimum Grade of C",
        "title": "Database Technologies"
    },
    "CS 4452": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to programming and human-centered principles of computing based on a communications and media computation context. Introduces user interface programming. Credit not awarded for both CS 4452 and CS 1315.",
        "prereqs": "",
        "title": "Human-Centered Computing"
    },
    "CS 4455": {
        "category": "Media",
        "credit": 3.0,
        "description": "Techniques for electronic game design and programming, including graphics game engines, motion generation, behavioral control for autonomous characters, interaction structure, social and interface issues of multi-user play, and the business aspects of game development. Credit not allowed for both CS 4455 and CS 6457.",
        "prereqs": "Undergraduate Semester level CS 3451 Minimum Grade of C",
        "title": "Video Game Design"
    },
    "CS 4460": {
        "category": "Media",
        "credit": 3.0,
        "description": "Introduction to principles and techniques of infomation visualization, the presentation of primarily abstract data to help people understand, analyze and make sense of data. Students will not receive credit for both CS 4460 and CS 7450.",
        "prereqs": "Undergraduate Semester level CS 1332 Minimum Grade of C",
        "title": "Intro Info Visualization"
    },
    "CS 4460R": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "This recitation supports the information visualization (CS 4460) course. Sessions will focus on introducing students to technical work with visualization programming languages and grammars important to the course.",
        "prereqs": "",
        "title": "CS 4460 Recitation"
    },
    "CS 4464": {
        "category": "Media",
        "credit": 3.0,
        "description": "A study of computational and technological advancements in journalism with emphasis on technologies for developing new tools and their potential impact on news and information. Credit not allowed for both CS 4464 and CS 6465.",
        "prereqs": "Undergraduate Semester level CS 1331 Minimum Grade of C",
        "title": "Computational Journalism"
    },
    "CS 4470": {
        "category": "People",
        "credit": 3.0,
        "description": "Concepts, techniques, structures, and strategies for implementation of interactive software. Credit not awarded for both CS 4470 and CS 6456.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C and (Undergraduate Semester level CS 3750 Minimum Grade of C or Undergraduate Semester level PSYC 3750 Minimum Grade of C)",
        "title": "User Interface Software"
    },
    "CS 4472": {
        "category": "Media",
        "credit": 3.0,
        "description": "Introduction to the design of online communities. Students study an existing community in depth. Credit not allowed for both CS 4472 and CS 6470.",
        "prereqs": "",
        "title": "Design of Online Comm"
    },
    "CS 4475": {
        "category": "Media",
        "credit": 3.0,
        "description": "An introductory course on the scientific, technical, perceptual, and aesthetic principles of pictures. Emphasis is on the techniques of image formation, analysis, merging, modification and their use for depiction of reality on a 2D medium of photographs.",
        "prereqs": "Undergraduate Semester level CS 1301 Minimum Grade of C or Undergraduate Semester level CS 1315 Minimum Grade of C or Undergraduate Semester level CS 1371 Minimum Grade of C",
        "title": "Comp Photography"
    },
    "CS 4476": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Introduction to computer vision including fundamentals of image formation, camera imaging geometry, feature detection and matching, stereo, motion estimation and tracking, image classification and scene understanding. Credit will not be awarded for both CS 4476 and CS 4495 or CS 6476.",
        "prereqs": "(Undergraduate Semester level MATH 2605 Minimum Grade of D or Undergraduate Semester level MATH 2401 Minimum Grade of D or Undergraduate Semester level MATH 24X1 Minimum Grade of T or Undergraduate Semester level MATH 2411 Minimum Grade of D or Undergraduate Semester level MATH 1553 Minimum Grade of D or Undergraduate Semester level MATH 1X54 Minimum Grade of T or Undergraduate Semester level MATH 1554 Minimum Grade of D or Undergraduate Semester level MATH 1564 Minimum Grade of D) and ( (Undergraduate Semester level CS 2110 Minimum Grade of C or Undergraduate Semester level CS 2261 Minimum Grade of C) or (Undergraduate Semester level ECE 2020 Minimum Grade of C and Undergraduate Semester level ECE 2035 Minimum Grade of C) )",
        "title": "Intro to Computer Vision"
    },
    "CS 4480": {
        "category": "Media",
        "credit": 3.0,
        "description": "A study of digital multimedia and the analysis and synthesis of digital video. Special attention paid to techniques for generating video special effects.",
        "prereqs": "Undergraduate Semester level CS 3451 Minimum Grade of C",
        "title": "Digital Video Special FX"
    },
    "CS 4495": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "An introduction to computer vision and machine perception. An intensive study of the process of generating a symbolic description of the scene by interpretation of images(s).",
        "prereqs": "(Undergraduate Semester level MATH 2605 Minimum Grade of D or Undergraduate Semester level MATH 2401 Minimum Grade of D or Undergraduate Semester level MATH 24X1 Minimum Grade of D or Undergraduate Semester level MATH 2411 Minimum Grade of D) and (Undergraduate Semester level CS 2110 Minimum Grade of C or Undergraduate Semester level CS 2261 Minimum Grade of C)",
        "title": "Computer Vision"
    },
    "CS 4496": {
        "category": "Media",
        "credit": 3.0,
        "description": "Motion techniques for computer animation and interactive games (keyframing, procedural methods, motion capture, and simulation) and principles for storytelling, composition, lighting, and interactivity.",
        "prereqs": "Undergraduate Semester level CS 3451 Minimum Grade of C",
        "title": "Computer Animation"
    },
    "CS 4497": {
        "category": "Media",
        "credit": 3.0,
        "description": "Aesthetics plays a key role in society and economy. Students will invent and test beautification algorithms for colors, music, and animations and more.",
        "prereqs": "Undergraduate Semester level CS 3451 Minimum Grade of C",
        "title": "Comp Aesthetics"
    },
    "CS 4510": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Computational machine models and their language classes. Undecidability. Resource-bounded computations. Central complexity-theoretic concepts such as complexity classes, reducibility and completeness.",
        "prereqs": "(Undergraduate Semester level CS 3510 Minimum Grade of C or Undergraduate Semester level CS 3511 Minimum Grade of C) and (Undergraduate Semester level MATH 3012 Minimum Grade of D or Undergraduate Semester level MATH 3022 Minimum Grade of D) and (Undergraduate Semester level MATH 3215 Minimum Grade of D or Undergraduate Semester level MATH 3235 Minimum Grade of D or Undergraduate Semester level MATH 3225 Minimum Grade of D or Undergraduate Semester level MATH 3770 Minimum Grade of D or Undergraduate Semester level MATH 3670 Minimum Grade of D or Undergraduate Semester level CEE 3770 Minimum Grade of D or Undergraduate Semester level ISYE 3770 Minimum Grade of D or (Undergraduate Semester level ISYE 2027 Minimum Grade of D and Undergraduate Semester level ISYE 2028 Minimum Grade of D) )",
        "title": "Automata and Complexity"
    },
    "CS 4520": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Approximation algorithms for NP-hard optimization problems, design and analysis techniques for such algorithms. Credit not allowed for both CS 4520 and CS 7520.",
        "prereqs": "Undergraduate Semester level CS 4540 Minimum Grade of C",
        "title": "Approximation Algs"
    },
    "CS 4530": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Efficient randomized algorithms with improved performance over deterministic algorithms, or for NP-hard optimization problems, design and analysis techniques for such algorithms. Credit not allowed for both CS 4530 and CS 7530.",
        "prereqs": "Undergraduate Semester level CS 4540 Minimum Grade of C",
        "title": "Randomized Algs"
    },
    "CS 4540": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Advanced techniques for designing and analyzing efficient algorithms for combinatorial, algebraic, and number theoretic problems. Credit not allowed for both CS 4540 and CS 6505 or CS 4540 and CS 6515.",
        "prereqs": "(Undergraduate Semester level CS 3510 Minimum Grade of C or Undergraduate Semester level CS 3511 Minimum Grade of C) and (Undergraduate Semester level MATH 3012 Minimum Grade of D or Undergraduate Semester level MATH 3022 Minimum Grade of D) and (Undergraduate Semester level MATH 3215 Minimum Grade of D or Undergraduate Semester level MATH 3235 Minimum Grade of D or Undergraduate Semester level MATH 3225 Minimum Grade of D or Undergraduate Semester level MATH 3770 Minimum Grade of D or Undergraduate Semester level MATH 3670 Minimum Grade of D or Undergraduate Semester level CEE 3770 Minimum Grade of D or Undergraduate Semester level ISYE 3770 Minimum Grade of D or (Undergraduate Semester level ISYE 2027 Minimum Grade of D and Undergraduate Semester level ISYE 2028 Minimum Grade of D) )",
        "title": "Advanced Algs"
    },
    "CS 4550": {
        "category": "Media",
        "credit": 3.0,
        "description": "Foundations and algorithms underlying the development and application of tools for the efficient transmission, analysis, filtering, and visualization of large scientific data sets.",
        "prereqs": "Undergraduate Semester level CS 3451 Minimum Grade of C",
        "title": "Scientific Visualization"
    },
    "CS 4560": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Technique for verifying, validating and testing software and hardware systems. Topics covered will include modeling, abstraction methods, evaluation and certification, and computer-aided verification methods.",
        "prereqs": "Undergraduate Semester level CS 1050 Minimum Grade of C and Undergraduate Semester level CS 3510 Minimum Grade of C",
        "title": "Verification of Systems"
    },
    "CS 4590": {
        "category": "Media",
        "credit": 3.0,
        "description": "A well-rounded exploration of digital audio and its importance in current research and applications. Exposes students to the principles, technology, and current research of computer audio.",
        "prereqs": "",
        "title": "Computer Audio"
    },
    "CS 4605": {
        "category": "Devices",
        "credit": 3.0,
        "description": "Investigates the infrastructure required to develop mobile and ubiquitous computing applications and establishes major research themes and experimental practices.Credit not awarded for both CS 4605 and CS 7470.",
        "prereqs": "Undergraduate Semester level CS 2110 Minimum Grade of C or Undergraduate Semester level CS 2261 Minimum Grade of C or (Undergraduate Semester level ECE 2020 Minimum Grade of C and Undergraduate Semester level ECE 2035 Minimum Grade of C)",
        "title": "Mobile&Ubiquitous Comp"
    },
    "CS 4611": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Basic concepts and methods of AI problem solving, knowledge representation, reasoning, and learning.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of C",
        "title": "AI Problem Solving"
    },
    "CS 4613": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Techniques for constructing large knowledge-based systems. Advanced symbolic AI techniques. Constraint systems.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of C",
        "title": "Knowledge Systems Engr"
    },
    "CS 4615": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Information-processing theories of modeling and design; topics include design decision-making, problem-solving and learning, and knowledge-based modeling and design.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of C",
        "title": "Knowledge-Based Modl&Dgn"
    },
    "CS 4616": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "An introductory course on pattern classification and decision problems with applications to character recognition, image analysis, and speech recognition.",
        "prereqs": "Undergraduate Semester level CS 1331 Minimum Grade of C",
        "title": "Pattern Recognition"
    },
    "CS 4622": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Based on human problem-solving, CBR has had many successes in industry and research. Topics include case representation, indexing and retrieval, similarity assessment, adaptation, learning. Credit not allowed for both CS 4622 and CS 7620.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of C",
        "title": "Case-Based Reasoning"
    },
    "CS 4625": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Explores how human-computer interaction and machine learning can interact to create personalized information environments. Emphasis on current research efforts from both fields.",
        "prereqs": "Undergraduate Semester level CS 1331 Minimum Grade of C",
        "title": "Intel & Interactive Sys"
    },
    "CS 4632": {
        "category": "Intelligence",
        "credit": 0.0,
        "description": "Hands-on course in which students program autonomous mobile robots and solve complex tasks for robot teams.",
        "prereqs": "Undergraduate Semester level CS 3630 Minimum Grade of C",
        "title": "Adv Intelligent Robotics"
    },
    "CS 4635": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Structured knowledge representation; knowledge-based methods of reasoning and learning; problem-solving, modeling and design.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of C",
        "title": "Knowledge-Based AI"
    },
    "CS 4641": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Machine learning techniques and applications. Topics include foundational issues; inductive, analytical, numerical, and theoretical approaches; and real-world applications. Credit not awarded for both CS 4641 and CS 7641/CSE 6740/ISYE 6740.",
        "prereqs": "Undergraduate Semester level CS 1331 Minimum Grade of C",
        "title": "Machine Learning"
    },
    "CS 4644": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "This course will cover the fundamental underpinnings and practice of deep learning, including neural network architectures, optimization algorithms, and applications to perception and Artificial Intelligence.",
        "prereqs": "(Undergraduate Semester level MATH 2605 Minimum Grade of D or Undergraduate Semester level MATH 2401 Minimum Grade of D or Undergraduate Semester level MATH 24X1 Minimum Grade of D or Undergraduate Semester level MATH 2411 Minimum Grade of D or Undergraduate Semester level MATH 2550 Minimum Grade of D or Undergraduate Semester level MATH 2551 Minimum Grade of D or Undergraduate Semester level MATH 2561 Minimum Grade of D or Undergraduate Semester level MATH 2X51 Minimum Grade of D) and (Undergraduate Semester level CS 2110 Minimum Grade of D or Undergraduate Semester level CS 2261 Minimum Grade of D) and (Undergraduate Semester level CS 3510 Minimum Grade of D or Undergraduate Semester level CS 3511 Minimum Grade of D)",
        "title": "Deep Learning"
    },
    "CS 4646": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "This course introduces students to the real world challenges of implementing machine learning based strategies including the algorithmic steps from information gathering to market orders.Credit not awarded for both CS 4646 and CS 7646.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of C",
        "title": "Mach Learn for Trading"
    },
    "CS 4649": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "We investigate algorithms for robots and complex systems that make intelligent decisions. Emphasis on the theoretical and empirical properties of classical, geometric, stochastic/dynamic planning.",
        "prereqs": "Undergraduate Semester level CS 1332 Minimum Grade of C",
        "title": "Robot Intelli Planning"
    },
    "CS 4650": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Methodologies for designing systems that comprehend natural language. Topics include lexical analysis, parsing, interpretation of sentences, semantic representation, organization of knowledge, and inference mechanisms. Credit not allowed for both CS 4650 and CS 7650.",
        "prereqs": "Undergraduate Semester level CS 3510 Minimum Grade of C or Undergraduate Semester level CS 3511 Minimum Grade of C",
        "title": "Natural Language"
    },
    "CS 4660": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to the theory and practice of educational technology. Covers learning theory applicable to educational technology, explains major research findings. Credit not awarded for both CS 4660 and CS 6460.",
        "prereqs": "",
        "title": "Educational Technology"
    },
    "CS 4665": {
        "category": "People",
        "credit": 3.0,
        "description": "Intensive project class in which students design, implement, and evaluate a piece of educational technology, applying the theory learned in Introduction to Educational Technology.",
        "prereqs": "Undergraduate Semester level CS 4660 Minimum Grade of C",
        "title": "Educ Tech: Dsgn & Eval"
    },
    "CS 4670": {
        "category": "People",
        "credit": 3.0,
        "description": "Research and practice in computer-supported collaborative learning. Review of existing systems and research, as well as evaluation and design methods.",
        "prereqs": "Undergraduate Semester level CS 4660 Minimum Grade of C",
        "title": "CSCL"
    },
    "CS 4675": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Focusing on fundamental issues, concepts, techniques, and technical challenges that are critical for designing and developing Internet systems, services and applications. Credit not allowed for both CS 4675 and CS 6675.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C or Undergraduate Semester level ECE 3057 Minimum Grade of C",
        "title": "Internet Sys & Services"
    },
    "CS 4685": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "In-depth study of systems and wireless networking issues in enabling pervasive computing environments and applications using a hand-on approach.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of C",
        "title": "Pervasive Sys Networking"
    },
    "CS 4690": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to empirical methods for gathering requirements and evaluating the end-user and usability of software systems.",
        "prereqs": "Undergraduate Semester level CS 3750 Minimum Grade of C or Undergraduate Semester level PSYC 3750 Minimum Grade of C",
        "title": "Empirical Methods in HCI"
    },
    "CS 4698": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Independent research conducted under the guidance of a faculty member.",
        "prereqs": "",
        "title": "Research Assistantship"
    },
    "CS 4699": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Independent research conducted under the guidance of a faculty member.",
        "prereqs": "",
        "title": "Undergraduate Research"
    },
    "CS 4710": {
        "category": "Modeling & Simulation",
        "credit": 0.0,
        "description": "Introduction to programming concepts and computing tools such as formal models and algorithms with applications from conceptual biology. May not be used by computer science majors for degree credit.",
        "prereqs": "",
        "title": "CS for Bioinformatics"
    },
    "CS 4723": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Entrepreneurial Junior Design. Teams comprised of CS, ECE, and ME students will design and build prototypes of their invention ideas and explore market fit.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C and (Undergraduate Semester level CS 3001 Minimum Grade of C or Undergraduate Semester level CS 4001 Minimum Grade of C or Undergraduate Semester level CS 4002 Minimum Grade of C or Undergraduate Semester level CS 4003 Minimum Grade of C or Undergraduate Semester level CS 4726 Minimum Grade of C or Undergraduate Semester level SLS 3110 Minimum Grade of C)",
        "title": "Inter Capstone Design"
    },
    "CS 4725": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Information security vulnerabilities and risks; legal, cost, privacy, and technology constraints; derivation of strategies; technical and procedural means of achieving desired results. Credit will not be awarded for both CS 4725 and CS 6725 or MGT 4725 or MGT 6725 or PUBP 4725.",
        "prereqs": "",
        "title": "Info Security Policies"
    },
    "CS 4726": {
        "category": "People",
        "credit": 3.0,
        "description": "This course takes a multi-disciplinary approach to privacy, a topic of great interest in the technology, policy, ethics, law, and business realms. Credit will not be awarded for both CS 4726 and MGT 4726 or MGT 6726 or CS 6726.",
        "prereqs": "",
        "title": "Privacy Tech Policy Law"
    },
    "CS 4731": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Examines the expressive possibilities of artificial intelligence techniques in computer games. Students learn AI programming techniques, and how they strongly interface with game design.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of C",
        "title": "Game AI"
    },
    "CS 4741": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Individual and group-based experiential learning activities to develop integrated human system management skills that prepare students for more successful capstone collaboration and learning. Credit not allowed for both CS 4741 and MGT 4741 or ME 4741.",
        "prereqs": "",
        "title": "Int Mgt Dev-Proj Prep"
    },
    "CS 4742": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Project-based course for students in Computing and Management minor to work in interdisciplinary teams on projects provided by corporate affiliates. Credit not allowed for both CS 4742 and MGT 4742 or ME 4742.",
        "prereqs": "Undergraduate Semester level CS 4741 Minimum Grade of C",
        "title": "Comp & Mgt Cap Proj"
    },
    "CS 4745": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Focus on technology design, adoption, and use as seen through the lens of global development.",
        "prereqs": "",
        "title": "Info&Com Tech&Global Dev"
    },
    "CS 4752": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Metaphysical and epistemological issues in the foundations, methods, and implications of computing. Issues include: minds, brains, and machines; representation and language; simulating nature. Crosslisted with PST 4752.",
        "prereqs": "",
        "title": "Phil Issues-Computation"
    },
    "CS 4770": {
        "category": "Media",
        "credit": 0.0,
        "description": "Focuses on informal design, integration of media theory, HCI and technology issues. Significant group design projects. Credit not awarded for both CS 4770 and LMC 4733/6340/CS 6770.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C and Undergraduate Semester level LCC 2700 Minimum Grade of D",
        "title": "Mixed Reality Design"
    },
    "CS 4791": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "An integrative course in cognitive science focusing on the integration and use of concepts and skills from cognitive science. A different integrative project or set of projects will be taken on each semester; students will contribute on the basis of their background and skill. Crosslisted with PST, PSYC, and ISYE 4791.",
        "prereqs": "",
        "title": "Integrative Proj-Cog Sci"
    },
    "CS 4792": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Individual project with a cognitive science faculty member, designed as a supplement to the student's senior design project or thesis in their major area. Crosslisted with PST, PSYC, and ISYE 4792.",
        "prereqs": "",
        "title": "Dsgn Proj-Cognitive Sci"
    },
    "CS 4793": {
        "category": "People",
        "credit": 3.0,
        "description": "An integrative course in cognitive science which uses a focus topic to deepen interdisciplinary perspective and develop cognitive science knowledge and skills.",
        "prereqs": "Undergraduate Semester level CS 3790 Minimum Grade of C or Undergraduate Semester level PST 3790 Minimum Grade of C or Undergraduate Semester level PSYC 3790 Minimum Grade of C or Undergraduate Semester level ISYE 3790 Minimum Grade of C",
        "title": "Perspectives-Cog Science"
    },
    "CS 4795": {
        "category": "Media",
        "credit": 0.0,
        "description": "3-D graphics pipelines. Physically-based rendering. Game engine architectures. GPU architectures. Graphics APIs. Vertex and pixel shader programming. Post-processing effects. Deferred rendering.",
        "prereqs": "Undergraduate Semester level ECE 2035 Minimum Grade of C or Undergraduate Semester level ECE 2036 Minimum Grade of C or Undergraduate Semester level CS 2110 Minimum Grade of C or Undergraduate Semester level CS 2261 Minimum Grade of C",
        "title": "GPU Prog for Video Games"
    },
    "CS 4801": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4802": {
        "category": "Miscellaneous",
        "credit": 2.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4803": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4804": {
        "category": "Miscellaneous",
        "credit": 4.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4805": {
        "category": "Miscellaneous",
        "credit": 5.0,
        "description": "Courses of timely interest to the profession, conducted by resident or visiting faculty.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4851": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Special Topics in CS - Lab",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4853": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Special Topics in CS (lecture and supervised lab)",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4863": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Special Topics",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4873": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4883": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4893": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Special Topics for CS (lecture + lab).",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 4901": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "An investigation of significant areas of information in computer science. Guided study and research.",
        "prereqs": "",
        "title": "Spec Prob-Computer Sci"
    },
    "CS 4902": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "An investigation of significant areas of information and computer science. Guided study and research.",
        "prereqs": "",
        "title": "Spec Prob-Computer Sci"
    },
    "CS 4903": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "An investigation of significant areas of information and computer science. Guided study and research.",
        "prereqs": "",
        "title": "Spec Prob-Computer Sci"
    },
    "CS 4911": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Team-based capstone experience allowing students to analyze a problem for a customer and manage the solution development through the full project life cycle.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C",
        "title": "Design Capstone Project"
    },
    "CS 4912": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Team-based capstone experience allowing students to analyze a problem for a customer and manage the solution development through the full project life cycle.",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of C",
        "title": "Design Capstone Project"
    },
    "CS 4980": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "",
        "prereqs": "",
        "title": "Research Capstone Proj"
    },
    "CS 4XXX": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "",
        "prereqs": "",
        "title": "Computer Sci Elective"
    },
    "CS 6010": {
        "category": "Media",
        "credit": 0.0,
        "description": "This is an interactive hands-on course that will teach students the principles of design at the individual level.",
        "prereqs": "",
        "title": "Principles of Design"
    },
    "CS 6035": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "A broad spectrum of information security: threats, basic cryptography, software vulnerabilities, programming for malice, operating system protections, network security, privacy, data mining, computer crime.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of D",
        "title": "Intro To Info Security"
    },
    "CS 6150": {
        "category": "People",
        "credit": 3.0,
        "description": "Exploring challenges faced by underserved populations and developing countries from a computing perspective.",
        "prereqs": "",
        "title": "Computing For Good"
    },
    "CS 6200": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "This course teaches operating system abstractions, mechanisms, and their implementations, including for concurrency (threads) and synchronization, resource management (CPU, memory, I/O), and distributed services.",
        "prereqs": "",
        "title": "Graduate Intro to OS"
    },
    "CS 6210": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Introduction to graduate-level topics in operating systems using research papers, textbook excerpts, and projects. Provides students thorough comprehension of distributed and parallel computer systems. Credit is not awarded for both CS 4210 and CS 6210.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of D",
        "title": "Adv Operating Systems"
    },
    "CS 6220": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "This course will cover the concepts, techniques, algorithms, and systems of big data systems and data analytics, with strong emphasis on big data processing systems, fundamental models and optimizations for data analytics and machine learning, which are widely deployed in real world big data analytics and applications.",
        "prereqs": "Undergraduate Semester level CS 4400 Minimum Grade of D",
        "title": "Big Data Sys & Analytics"
    },
    "CS 6230": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Introduction to MIMD parallel computation, using textbook excerpts, research papers, and projects on multiple parallel machines. Emphasizes practical issues in high-performance computing.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of D",
        "title": "High Perf Parallel Comp"
    },
    "CS 6235": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Principles of real-time systems, as occurring in robotics and manufacturing, interactive, and multimedia applications. Reviews and uses real-time operating systems.Credit not awarded for both CS 6235 and CS 4220.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of D",
        "title": "Real-Time Systems"
    },
    "CS 6238": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Design principles of secure systems, authentication, access control and authorization, discretionary and mandatory security policies, secure kernel design, and secure databases.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of D and Undergraduate Semester level CS 4235 Minimum Grade of D",
        "title": "Secure Computer Systems"
    },
    "CS 6241": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Design and implementation of modern compilers, focusing upon optimization and code generation.",
        "prereqs": "Undergraduate Semester level CS 4240 Minimum Grade of D",
        "title": "Compiler Design"
    },
    "CS 6245": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Design and implementation of compilers for parallel and distributed computers, focusing upon optimization and code generation.",
        "prereqs": "Undergraduate Semester level CS 4240 Minimum Grade of D",
        "title": "Parallelizing Compilers"
    },
    "CS 6246": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Design and implementation of object-oriented systems. Aspect-oriented programming, type systems, OO language implementation (virtual dispatch, GC), OO language design (genericity, reflection, mixins).",
        "prereqs": "Undergraduate Semester level CS 2340 Minimum Grade of D",
        "title": "Object-Oriented Systems"
    },
    "CS 6250": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Principles and practice of computer networks, including signaling and framing, error control, medium access, routing, congestion control, end-to-end transport, and network APIs.",
        "prereqs": "",
        "title": "Computer Networks"
    },
    "CS 6255": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Focus on network, system, and applications management. Principles and practice of various network management standards will be presented. Course includes project assignment.",
        "prereqs": "Graduate Semester level CS 6250 Minimum Grade of D",
        "title": "Network Management"
    },
    "CS 6260": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Cryptographic algorithms, cryptanalysis, symmetric cryptography, public key cryptography, DES, AES, RSA, hash and MAC functions, digital signatures, pseudo-random generators, cryptographic protocols, SSL//TLS, SET. Credit not allowed for both CS 6260 and ECE 6280.",
        "prereqs": "Undergraduate Semester level CS 4235 Minimum Grade of D",
        "title": "Applied Cryptography"
    },
    "CS 6262": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Design principles of secure network protocols and systems, authentication, integrity, confidentiality, privacy, information hiding, digital watermarking, access control, firewall, intrusion detection, and case studies.",
        "prereqs": "Undergraduate Semester level CS 4235 Minimum Grade of D and Undergraduate Semester level CS 4251 Minimum Grade of D",
        "title": "Network Security"
    },
    "CS 6263": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "This course provides an introduction to security issues relating to various cyber-physical systems including industrial control systems and those considered critical infrastructure systems.",
        "prereqs": "",
        "title": "Intro Cyber Phys Sys Sec"
    },
    "CS 6264": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "This course will help students develop both in-depth knowledge and hands-on skills in a number of important cybersecurity areas, including software security, malware and threat analysis, end-point security, network security, web security, mobile security, and machine learning based security analytics.",
        "prereqs": "",
        "title": "Infosec Labs: Defenses"
    },
    "CS 6265": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "This course covers advanced techniques for writing exploits, taught through an intense, hands-on security laboratory, following a cyberspace war game called Capture-The-Flag.",
        "prereqs": "Graduate Semester level CS 6238 Minimum Grade of D and Graduate Semester level CS 6262 Minimum Grade of D",
        "title": "Info Sec Lab Binexp"
    },
    "CS 6266": {
        "category": "Info Internetworks",
        "credit": 5.0,
        "description": "Capstone independent study placing each student in a commercial, industrial, academic, or government setting where they must solve real-world security problems.",
        "prereqs": "Graduate Semester level CS 6238 Minimum Grade of D and Graduate Semester level CS 6260 Minimum Grade of D and Graduate Semester level CS 6262 Minimum Grade of D",
        "title": "Info Security Practicum"
    },
    "CS 6269": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Logical foundations of high-assurance systems, formal models for access control, authentication, and trust; techniques for constructing high-assurance systems.",
        "prereqs": "Undergraduate Semester level CS 3500 Minimum Grade of D and Undergraduate Semester level CS 4235 Minimum Grade of D",
        "title": "Formal Info Assur Model"
    },
    "CS 6280": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Methods for evaluating the performance of communication networks with emphasis on modeling, mathematical analysis, computer simulation, and measurement.",
        "prereqs": "(Undergraduate Semester level MATH 3215 Minimum Grade of D or Undergraduate Semester level MATH 3225 Minimum Grade of D) and Graduate Semester level CS 6250 Minimum Grade of D",
        "title": "Eval Communication Nets"
    },
    "CS 6290": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Topics concerning very high-performance computers including techniques exploiting parallelism in single and multiple processor systems. Credit not allowed for both CS 6290 and any of the following courses: CS 4290, ECE 4100, ECE 6100.",
        "prereqs": "Undergraduate Semester level CS 2200 Minimum Grade of D",
        "title": "High Perform Comput Arch"
    },
    "CS 6291": {
        "category": "Devices",
        "credit": 3.0,
        "description": "First, this course introduces the student to embedded domain-specific processor and instruction set design issues. Next, machine-specific optimizations for performance and for energy consumption are discussed.",
        "prereqs": "Undergraduate Semester level CS 4290 Minimum Grade of D",
        "title": "Embedded Software Opt."
    },
    "CS 6300": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "The process of developing software systems. Includes development and assessment of processes, their instantiation in actual product development, and techniques ensuring quality of developed products.",
        "prereqs": "",
        "title": "Software Dev Process"
    },
    "CS 6301": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "This project-based course will cover fundamental principles, advanced techniques, and tools for the development of high-quality, industrial-strength software.",
        "prereqs": "",
        "title": "Adv Software Engineering"
    },
    "CS 6310": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Principles and concepts involved in the design and analysis of large software systems.",
        "prereqs": "Undergraduate Semester level CS 6300 Minimum Grade of D",
        "title": "Software Arch & Design"
    },
    "CS 6320": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Methods and principles for determining, documenting, analyzing, and formally specifying requirements for software systems.",
        "prereqs": "Undergraduate Semester level CS 6300 Minimum Grade of D",
        "title": "Requirements Analysis"
    },
    "CS 6330": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Introduction to methods and principles for programming, testing, and managing the evolution of software systems.",
        "prereqs": "Undergraduate Semester level CS 6300 Minimum Grade of D",
        "title": "Software Generation&Test"
    },
    "CS 6340": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Fundamental prinicples and advanced techniques for static and dynamic program analysis and software testing. Software reliability, resilience, and trustworthiness.",
        "prereqs": "",
        "title": "Software Analysis & Test"
    },
    "CS 6365": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Survey of basic software concepts and techniques used in mission-critical systems and applications, combined with in-depth study of fundamental principles underlying enterprise computing. Credit not allowed for both CS 6365 and CS 4365.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of D or Undergraduate Semester level CS 4400 Minimum Grade of D",
        "title": "Intro Enterprise Comput."
    },
    "CS 6390": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Design, structure, and goals of programming languages. Object-oriented, logic, functional, and traditional languages. Semantic models. Parallel programming languages.",
        "prereqs": "",
        "title": "Programming Languages"
    },
    "CS 6400": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Study of fundamental concepts with regard to relational databases. Topics covered include database design, query processing, concurrency control, and recovery. Credit not given for both CS 6400 and CS 6754.",
        "prereqs": "Undergraduate Semester level CS 4400 Minimum Grade of D",
        "title": "DB Sys Concepts& Design"
    },
    "CS 6402": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Fundamentals of designing and using databases: conceptual data models to database-specific models, SQL, storage structures. Security-related topics include privacy, access control, backup, recovery, SQL injection. Credit not allowed for both CS 6402 and CS 4400.",
        "prereqs": "",
        "title": "Databases and Infosec"
    },
    "CS 6411": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Study of advanced database concepts as they apply to object-oriented database systems. Topics include semantic data models, object-oriented query languages, tools, and applications.",
        "prereqs": "Graduate Semester level CS 6400 Minimum Grade of D",
        "title": "O-O Database Model & Sys"
    },
    "CS 6421": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Study of advanced database concepts for temporal databases with emphasis on storage structure, processing and query languages, as well as active database concepts and implementation.",
        "prereqs": "Graduate Semester level CS 6400 Minimum Grade of D",
        "title": "Tempor,Spatial&Active DB"
    },
    "CS 6422": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Design and implementatuion of a databse system covering: storage manager, query optimizer, transaction manager, and recovery manager. Study of the advantages of different implementation algorithms. Credit not allowed for both CS 6422 and CS 4420.",
        "prereqs": "Undergraduate Semester level CS 4400 Minimum Grade of D",
        "title": "Database System Implemnt"
    },
    "CS 6430": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Study of algorithms and performance in advanced databases. Systems include parallel, distributed, and client-server databases. Applications include data mining and on-line analytical processing.",
        "prereqs": "Undergraduate Semester level CS 4420 Minimum Grade of D or Undergraduate Semester level CS 6400 Minimum Grade of D",
        "title": "Parallel&Distributed DB"
    },
    "CS 6440": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "A broad review of the US health system and the application of informatics to the clinical practice of medicine, digital imaging, public health and bioinformatics.",
        "prereqs": "",
        "title": "Intro Health Informatics"
    },
    "CS 6451": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to the range of issues across the HCC disciplines, including design and research methodologies: cognitive, social, and cultural theories; assessment and evaluation: ethical issues.",
        "prereqs": "",
        "title": "Human-Centered Computing"
    },
    "CS 6452": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to design, prototyping and implementation of systems for human-centered computing. Focuses on core concepts in computer science and implications for interactive systems.",
        "prereqs": "Undergraduate Semester level CS 4452 Minimum Grade of D",
        "title": "Prototyping Interact Sys"
    },
    "CS 6454": {
        "category": "People",
        "credit": 3.0,
        "description": "Qualitative methods for HCI including data collection through interviews, observations and design, analysis using research and industry standards, and methods for communicating findings to industry.",
        "prereqs": "",
        "title": "Qualitative Methods HCI"
    },
    "CS 6455": {
        "category": "People",
        "credit": 3.0,
        "description": "Examines usability in the software development process with an emphasis on usability, requirements, methodology, design, and evaluation.",
        "prereqs": "Undergraduate Semester level CS 6750 Minimum Grade of D or Undergraduate Semester level PSYC 6750 Minimum Grade of D",
        "title": "User Interface Dsgn&Eval"
    },
    "CS 6456": {
        "category": "People",
        "credit": 3.0,
        "description": "Considers the architectural and algorithmic principles behind the implementation of interactive software systems and the tools that support them. Credit not awarded for CS 6456 and CS 4470.",
        "prereqs": "Undergraduate Semester level CS 6750 Minimum Grade of D or Undergraduate Semester level PSYC 6750 Minimum Grade of D",
        "title": "Principles-UI Software"
    },
    "CS 6457": {
        "category": "Media",
        "credit": 3.0,
        "description": "Techniques for electronic game design and programming, including graphics, game engines, animation, behavioral control for autonomous characters, interaction, social and interface issues of multi-user play. Credit not allowed for both CS 6457 and CS 4455.",
        "prereqs": "",
        "title": "Video Game Design"
    },
    "CS 6460": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to educational technology, with an emphasis on theoretical foundations. Introduces basic philosophies, approaches, and technologies. Analyzes issues surrounding technology's impact on education. Credit not awarded for both CS 4660 and CS 6460.",
        "prereqs": "",
        "title": "Educ Tech-Foundations"
    },
    "CS 6461": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to computing education research (CER). History and influential early work. Learning goals for different populations. Design of research studies in CER.",
        "prereqs": "",
        "title": "Computing Ed Research"
    },
    "CS 6465": {
        "category": "Media",
        "credit": 3.0,
        "description": "Technology is rapidly affecting how news information is gathered, reported, visualized, aggregated, summarized, distributed, and consumed. This class studies the computational technologies that impact journalism. Credit not allowed for both CS 6455 and CS 4464.",
        "prereqs": "",
        "title": "Computational Journalism"
    },
    "CS 6470": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to the design of online communities. Students study an existing community in depth, and then develop a new community design. Credit not allowed for both CS 6470 and CS 4472.",
        "prereqs": "",
        "title": "Online Communities"
    },
    "CS 6471": {
        "category": "People",
        "credit": 3.0,
        "description": "This graduate seminar focuses on text and network analysis of data with applications to domains such as political science, sociolinguistics, and public health.",
        "prereqs": "",
        "title": "Comp Social Science"
    },
    "CS 6474": {
        "category": "People",
        "credit": 3.0,
        "description": "Design and prototype new social computing systems, as well as analyze social media data.",
        "prereqs": "",
        "title": "Social Computing"
    },
    "CS 6475": {
        "category": "Media",
        "credit": 3.0,
        "description": "This class explores the impact of computation on the entire workflow of photography, from how light is captured by a camera, to how the images are processed, enhanced, and improved to generate novel photographs.",
        "prereqs": "",
        "title": "Comp. Photography"
    },
    "CS 6476": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Introduction to computer vision including fundamentals of image formation, camera imaging geometry, feature detection and matching, stereo, motion estimation and tracking, image classification and scene understanding. Credit not awarded for both CS 6476 and CS 4495 or CS 4476.",
        "prereqs": "",
        "title": "Computer Vision"
    },
    "CS 6480": {
        "category": "Media",
        "credit": 3.0,
        "description": "Principles, techniques, and practice in data, information, multivariate, and scientific visualization. Includes visualization methods, data structures, examples, and tools.",
        "prereqs": "Undergraduate Semester level CS 4451 Minimum Grade of D",
        "title": "Comp Visualiz Techniques"
    },
    "CS 6485": {
        "category": "Media",
        "credit": 3.0,
        "description": "Algorithms, software, and practical applications of visualization techniques in science, engineering, business, and medicine. Includes data structures, multivariate visualization, interactive visualization, and visual representations and examples. Computer science students cannot receive credit for this course.",
        "prereqs": "",
        "title": "Visual Meth-Sci & Engr"
    },
    "CS 6491": {
        "category": "Media",
        "credit": 3.0,
        "description": "Mathematical/physical/perceptual principles and modeling/rendering techniques used to create, represent, display, and animate models of 3D shapes and their properties.",
        "prereqs": "Undergraduate Semester level CS 4451 Minimum Grade of D",
        "title": "Computer Graphics"
    },
    "CS 6497": {
        "category": "Media",
        "credit": 3.0,
        "description": "Aesthetics play a key role in society and economy. Students will invent and test beautification algorithms for colors, music, and animations and more.",
        "prereqs": "Graduate Semester level CS 6491 Minimum Grade of D",
        "title": "Comp Aesthetics"
    },
    "CS 6505": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Important concepts from computability theory; techniques for designing algorithms for combinatorial, algebraic, and number-theoretic problems; basic concepts such as NP-Completeness from computational complexity theory. Credit not awarded for both CS 6505 and CS 4540/6515.",
        "prereqs": "Undergraduate Semester level CS 3510 Minimum Grade of D",
        "title": "Computability&Algorithms"
    },
    "CS 6515": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Design and analysis of algorithms on a graduate level, including dynamic programming, divide and conquer, FFT, graph and flow algorithms, RSA, linear programming, and NP-completedness.",
        "prereqs": "",
        "title": "Intro to Grad Algorithms"
    },
    "CS 6520": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Introduction to resource-bounded computations, central complexity-theoretic concepts such as complexity classes, reducibility, completeness, and intractability.",
        "prereqs": "Undergraduate Semester level CS 3500 Minimum Grade of D",
        "title": "Computational Complexity"
    },
    "CS 6550": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Advanced techniques for designing and analyzing efficient algorithms for combinatorial, algebraic, and number-theoretic problems.",
        "prereqs": "Undergraduate Semester level CS 3500 Minimum Grade of D",
        "title": "Design& Analy-Algorithms"
    },
    "CS 6601": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Basic concepts and methods of artificial intelligence including both symbolic/conceptual and numerical/probabilistic techniques.",
        "prereqs": "Undergraduate Semester level CS 2600 Minimum Grade of D",
        "title": "Artificial Intelligence"
    },
    "CS 6603": {
        "category": "People",
        "credit": 3.0,
        "description": "This course covers various Artificial Intelligence and bias mitigation techniques that can be used to counterbalance the potential misuse and abuse of learning from data.",
        "prereqs": "",
        "title": "AI Ethics Society"
    },
    "CS 6670": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Algorithms for synchronous, asynchronous, and partially synchronous networks; analysis, control, and implementation of distributed systems such as robot fleets, animal groups.",
        "prereqs": "Undergraduate Semester level CS 4600 Minimum Grade of D",
        "title": "Distrib Cntrl Algorithms"
    },
    "CS 6675": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Survey of basic Internet computing concepts and techniques used in Internet systems and applications, combined with in-depth study of fundamental principles underlying Internet computing. Credit not allowed for both CS 6675 and CS 4675.",
        "prereqs": "Undergraduate Semester level CS 3210 Minimum Grade of D or Undergraduate Semester level CS 4499 Minimum Grade of D",
        "title": "Advance Internet Comput"
    },
    "CS 6705": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "A study of the principles and practice of artificial intelligence in areas other than computer science, with particular focus on engineering, science, and business applications. Computer science majors cannot receive credit for this course.",
        "prereqs": "",
        "title": "Applications of AI"
    },
    "CS 6725": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Information security vulnerabilities and risks; legal, cost, privacy, and technology constraints; derivation of strategies; technical and procedural means of achieving desired ends. Credit not awarded for both CS 6725 and CS 4725/MGT 4725/6725/PUBP 4725/6725.",
        "prereqs": "Undergraduate Semester level CS 4235 Minimum Grade of D",
        "title": "Info Security Policies"
    },
    "CS 6726": {
        "category": "People",
        "credit": 3.0,
        "description": "This course takes a multi-disciplinary approach to privacy, a topic of great interest in the technology, policy, ethics, law, and business realms. Credit will not be awarded for both CS 6726 and CS 4726 or MGT 4726 or MGT 6726.",
        "prereqs": "",
        "title": "Privacy Tech Policy Law"
    },
    "CS 6727": {
        "category": "Info Internetworks",
        "credit": 0.0,
        "description": "Capstone independent study project placing each student in a commercial, academic or government setting where he or she identifies a major cyber security problem, and explores and evaluates a solution that addresses it with realistic assumptions about the organizational context. The chose problem must be approved by course instructor. Cross-listed with ECE and PUBP 6727.",
        "prereqs": "Undergraduate Semester level CS 6035 Minimum Grade of D and (Undergraduate Semester level PUBP 6725 Minimum Grade of D or Undergraduate Semester level CS 6725 Minimum Grade of D)",
        "title": "Cyber Sec Practicum"
    },
    "CS 6730": {
        "category": "Media",
        "credit": 3.0,
        "description": "Introductory course on design principles and applications of data visualization. This course teaches best practices for visualizing datasets from diverse domains intended to help people make sense of data.",
        "prereqs": "",
        "title": "Data Vis Principles"
    },
    "CS 6745": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Focus on technology design, adoption, and use as seen through the lens of global development.",
        "prereqs": "",
        "title": "Info&Com Tech&Global Dev"
    },
    "CS 6747": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "This course covers advanced approaches for the analysis of malicious software and explores recent research and unsolved problems in software protection and forensics.",
        "prereqs": "",
        "title": "ADV Malware Analysis"
    },
    "CS 6750": {
        "category": "People",
        "credit": 3.0,
        "description": "Describes the characteristics of interaction between humans and computers and demonstrates techniques for the evaluation of user-centered systems. Crosslisted with PSYC 6750.",
        "prereqs": "",
        "title": "Human-Computer Interact"
    },
    "CS 6753": {
        "category": "People",
        "credit": 1.0,
        "description": "Preparation for a professional career in HCI. Hands-on workshops in resume and portfolio building, interviewing, public speaking, team work. HCI career choices and trajectories.",
        "prereqs": "",
        "title": "HCI Prof Prep & Practice"
    },
    "CS 6754": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Modeling and managing engineering information systems, integration of design and manufacturing functions in engineering product development, logical models of engineering product and processes. Credit not given for CS 6400 and CS 6754. Crosslisted with ME 6754.",
        "prereqs": "",
        "title": "Engr Database Mgt System"
    },
    "CS 6755": {
        "category": "People",
        "credit": 3.0,
        "description": "Describes the theory and practice of designing effective and efficient interactions between people and technology. Students do not receive credit for both CS 6755 and PSYC 6755.",
        "prereqs": "",
        "title": "HCI Foundations"
    },
    "CS 6763": {
        "category": "Media",
        "credit": 3.0,
        "description": "Analysis of design processes; analysis of current design tools at both the user interface and functional levels; procedures for developing better design tools. Credit not allowed for both CS 6763 and ID 6763 or COA 6763.",
        "prereqs": "",
        "title": "Design of Environments"
    },
    "CS 6764": {
        "category": "Media",
        "credit": 3.0,
        "description": "Software development course focusing on 3D geometric constructions and modeling; emphasizes solid modeling and its role in design. Crosslisted with COA 6764.",
        "prereqs": "",
        "title": "Geometric Modeling"
    },
    "CS 6770": {
        "category": "Media",
        "credit": 0.0,
        "description": "Introduction to the design of Mixed Reality experiences. Focuses on informal design, integration of media theory, HCI and technology issues. Significant group design projects.Credit not awarded for both CS 6770 and CS 4770/LMC 4733/6340.",
        "prereqs": "",
        "title": "Mixed Reality Design"
    },
    "CS 6780": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "A study of methods for enhancing, analyzing, interpreting, and visualizing information from two- and three-dimensional data obtained from a variety of medical image modalities. Crosslisted with ECE and BMED 6780.",
        "prereqs": "Graduate Semester level ECE 6786 Minimum Grade of D or Graduate Semester level BMED 6786 Minimum Grade of D",
        "title": "Medical Image Processing"
    },
    "CS 6795": {
        "category": "People",
        "credit": 3.0,
        "description": "Multidisciplinary perspectives on cognitive science. Interdisciplinary approaches to issues in cognition, including memory, language, problem solving, learning, perception, and action. Crosslisted with ISYE and PSYC 6795.",
        "prereqs": "",
        "title": "Intro-Cognitive Science"
    },
    "CS 6998": {
        "category": "People",
        "credit": 1.0,
        "description": "Final project for students completing a Human-Computer Interaction master's degree. Repeatable for multi-semester projects.",
        "prereqs": "",
        "title": "HCI Master's Project"
    },
    "CS 6999": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Final project for students completing a master's degree in the College of Computing. Repeatable for multi-semester projects.",
        "prereqs": "",
        "title": "Master's Project"
    },
    "CS 6XXX": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "",
        "prereqs": "",
        "title": "Computer Sci Elective"
    },
    "CS 7000": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Master's Thesis Prerequisite: consent of the College.",
        "prereqs": "",
        "title": "Master's Thesis"
    },
    "CS 7001": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "Research tools including computer systems, as well as fundamental problem-solving skills, are introduced. Lectures on current computing research are presented and projects are required. Credit not allowed in a program of study for a graduate degree.",
        "prereqs": "",
        "title": "Grad Studies-Computing"
    },
    "CS 7110": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Issues in the design, implementation, and programming of parallel machines. Credit not allowed for both CS 7110 and CS 4233.",
        "prereqs": "Graduate Semester level CS 6290 Minimum Grade of D",
        "title": "Parallel Computer Arch"
    },
    "CS 7210": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Fundamental concepts in distributed systems, including global states, logical clocks, and failure models. Distributed algorithms and their implementations using advanced distributed programming systems.",
        "prereqs": "Graduate Semester level CS 6210 Minimum Grade of D",
        "title": "Distributed Computing"
    },
    "CS 7230": {
        "category": "Systems & Architecture",
        "credit": 0.0,
        "description": "Design, implementation, and evaluation of systems software. Distributed/parallel applications will be constructed and evaluated using the systems support that is developed.",
        "prereqs": "Undergraduate Semester level CS 4240 Minimum Grade of D and Graduate Semester level CS 6210 Minimum Grade of D",
        "title": "Software Dsgn,Impl& Eval"
    },
    "CS 7250": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Focus on the data link layer and its relationship to layers below and above. Gigabit Ethernet, SONTET, fibre channel; media including wireless, satellite, xDSL, cable.",
        "prereqs": "Graduate Semester level CS 6250 Minimum Grade of D",
        "title": "Broadband Networking Sys"
    },
    "CS 7260": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Detailed discussion of the problems and solution techniques that arise in internetworking. Topics include routing, addressing, quality of service, and security.",
        "prereqs": "Graduate Semester level CS 6250 Minimum Grade of D",
        "title": "Internet Arch& Protocols"
    },
    "CS 7270": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "End-to-end functional building blocks and their use in adaptive and non-adaptive applications, including multimedia: coding, compression, security, directory services.",
        "prereqs": "Graduate Semester level CS 6250 Minimum Grade of D",
        "title": "Networked Apps&Services"
    },
    "CS 7280": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Characteristics of real networks in nature and technology, network measurement methods, network analysis, evolving networks, dynamic network processes, co-evolution of structure and function.",
        "prereqs": "Undergraduate Semester level MATH 1554 Minimum Grade of D or Undergraduate Semester level MATH 1564 Minimum Grade of D and Undergraduate Semester level CS 1331 Minimum Grade of D and Undergraduate Semester level CS 3510 Minimum Grade of D",
        "title": "Network Science"
    },
    "CS 7290": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Low-level organization and hardware algorithms for the implementation of modern high-performance microprocessors including concept designs and real-world case studies.",
        "prereqs": "Graduate Semester level CS 6290 Minimum Grade of D",
        "title": "Adv. Microarchitecture"
    },
    "CS 7292": {
        "category": "Systems & Architecture",
        "credit": 3.0,
        "description": "Hardware support for process isolation, virtualization, debugging, and protection from side-channel attacks. Faults and failures, error tolerance, error rate budgeting, lifetime realiability of devices.",
        "prereqs": "Graduate Semester level CS 6290 Minimum Grade of D",
        "title": "Reliable Secure Comparch"
    },
    "CS 7450": {
        "category": "Media",
        "credit": 3.0,
        "description": "Study of computer visualization principles, techniques, and tools used for explaining and understanding symbolic, structured, and/or hierarchical information. Includes data and software visualization. Students cannot receive credit for both CS 7450 and CS 4460.",
        "prereqs": "Graduate Semester level CS 6750 Minimum Grade of D or Graduate Semester level PSYC 6750 Minimum Grade of D",
        "title": "Inform Visualization"
    },
    "CS 7451": {
        "category": "People",
        "credit": 3.0,
        "description": "This course covers the role of people in data science and visual data analysis, including cognitive processes, bias, perception, and decision-making theories and frameworks.",
        "prereqs": "",
        "title": "Hum-Center Data Analysis"
    },
    "CS 7455": {
        "category": "People",
        "credit": 3.0,
        "description": "In-depth focus on theoretical, methodological, conceptual, and technical issues across the HCC disciplines associated with humans (cognitive, biological, socio-cultural); design; ethics; and analysis and evaluation.",
        "prereqs": "Graduate Semester level CS 6452 Minimum Grade of D",
        "title": "Issues/Human-Center Comp"
    },
    "CS 7460": {
        "category": "People",
        "credit": 3.0,
        "description": "Introduction to computer-supported collaborative work, workflow automation, and meeting augmentation. The course deals with models, enabling technology, systems, and applications.",
        "prereqs": "",
        "title": "Collaborative Computing"
    },
    "CS 7465": {
        "category": "People",
        "credit": 3.0,
        "description": "Intensive project class in which students design, implement, and evaluate a piece of educational technology, applying the theory learned in Educational Technology: Conceptual Foundations.",
        "prereqs": "Graduate Semester level CS 6460 Minimum Grade of D",
        "title": "Edu Tech-Design and Eval"
    },
    "CS 7467": {
        "category": "People",
        "credit": 3.0,
        "description": "Computer-supported collaborative learning is the use of Internet-based technologies to support learning in social settings. Focus on issues of implementation and evaluation.",
        "prereqs": "Graduate Semester level CS 6460 Minimum Grade of D",
        "title": "Comp Collaborative Learn"
    },
    "CS 7476": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Advanced topics in computer vision, which includes a deep dive into both the theoretical foundations of computer vision to the practical issues of building real systems that use computer vision. Credit will not be awarded for CS 7476 and CS 7495.",
        "prereqs": "Graduate Semester level CS 6476 Minimum Grade of D",
        "title": "Advanced Computer Vision"
    },
    "CS 7490": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Advanced techniques in realistic image synthesis based on the physics of light. Anti-aliasing, textures, surface reflectance, distribution ray tracing, volume rendering, radiosity, and image-based rendering.",
        "prereqs": "",
        "title": "Adv Image Synthesis"
    },
    "CS 7491": {
        "category": "Media",
        "credit": 3.0,
        "description": "Multiresolution, compression, collision, morphing, visibility, and computational geometry techniques for accessing, rendering, and animating complex 3D models in engineering, scientific, business, or entertainment applications.",
        "prereqs": "Graduate Semester level CS 6491 Minimum Grade of D",
        "title": "3D Complexity"
    },
    "CS 7492": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Study different computer simulation methods for use in investigating biological systems, including bio-molecules, cells and full organisms.",
        "prereqs": "",
        "title": "Simulation of Biology"
    },
    "CS 7495": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "An introduction to computer vision and machine perception. An intensive study of the process of generating a symbolic description of the scene by interpretation of images(s). Credit will not be awarded for both CS 7495 and CS 7476.",
        "prereqs": "",
        "title": "Computer Vision"
    },
    "CS 7496": {
        "category": "Media",
        "credit": 3.0,
        "description": "Motion techniques for computer animation and interactive games (keyframing, procedural methods, motion capture, and simulation) and principles for storytelling, composition, lighting, and interactivity.",
        "prereqs": "Undergraduate Semester level CS 4451 Minimum Grade of D",
        "title": "Computer Animation"
    },
    "CS 7497": {
        "category": "Media",
        "credit": 3.0,
        "description": "An introduction to virtual reality and virtual environments. Issues covered will include VR technology, software design, 3D human-computer interaction, and applications for VR.",
        "prereqs": "Undergraduate Semester level CS 4451 Minimum Grade of D",
        "title": "Virtual Environments"
    },
    "CS 7499": {
        "category": "Media",
        "credit": 3.0,
        "description": "In this course we study the principles and algorithms underlying 3D Reconstruction and Mapping in Computer Vision, Robotics, and Augmented Reality.",
        "prereqs": "",
        "title": "3D Reconstruction"
    },
    "CS 7510": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Algorithms for graph problems such as maximum flow, matching, network reliability, minimum cuts, covering, coloring, planarity, shortest paths, and connectivity. Crosslisted with MATH 7510 and ISYE 7510.",
        "prereqs": "Graduate Semester level CS 6505 Minimum Grade of D or Graduate Semester level CS 6550 Minimum Grade of D",
        "title": "Graph Algorithm"
    },
    "CS 7520": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Approximation algorithms for NP-hard optimization problems, design and analysis techniques for such algorithms. Credit not allowed for both CS 7520 and CS 4520.",
        "prereqs": "Graduate Semester level CS 6505 Minimum Grade of D or Graduate Semester level CS 6550 Minimum Grade of D",
        "title": "Approximation Algorithms"
    },
    "CS 7525": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Algorithmic aspects of game theory covering topics at the intersection of computer science, economics, and game theory with applications to domains such as internet.",
        "prereqs": "Graduate Semester level CS 6550 Minimum Grade of D",
        "title": "Algorithmic Game Theory"
    },
    "CS 7530": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Techniques for designing and analyzing randomized algorithms, derandomization techniques. Credit not allowed for both CS 7530 and CS 4530.",
        "prereqs": "Graduate Semester level CS 6505 Minimum Grade of D or Graduate Semester level CS 6550 Minimum Grade of D",
        "title": "Randomized Algorithms"
    },
    "CS 7535": {
        "category": "Theory",
        "credit": 3.0,
        "description": "This course studies Markov Chain Monte Carlo algorithms, widely-used in a variety of scientific fields, focusing on mathematical techniques for analyzing their convergence rates.",
        "prereqs": "Graduate Semester level CS 6505 Minimum Grade of D or Graduate Semester level CS 6550 Minimum Grade of D",
        "title": "Markov Chain Monte Carlo"
    },
    "CS 7540": {
        "category": "Theory",
        "credit": 3.0,
        "description": "Spectral methods mathematics and algorithmic insights driving applications with large data sets in domains such as web-search, information-retrieval, and medical diagnosis and prediction.",
        "prereqs": "",
        "title": "Spectral Algorithms"
    },
    "CS 7545": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "This course provides a basic arsenal of powerful mathematical tools for the analysis of learning algorithms, focusing on both statistical and computational aspects.",
        "prereqs": "",
        "title": "Machine Learning Theory"
    },
    "CS 7560": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "One-way functions, pseudorandomness, public-key and identity-based cryptography, commitment and zero knowledge.",
        "prereqs": "",
        "title": "Theory of Cryptography"
    },
    "CS 7610": {
        "category": "Media",
        "credit": 3.0,
        "description": "Information-processing theories of modeling and design; topics include design decision making, problem solving and learning, and knowledge-based modeling and design.",
        "prereqs": "Graduate Semester level CS 4600 Minimum Grade of D",
        "title": "Modeling and Design"
    },
    "CS 7611": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Basic concepts and methods of AI problem solving, knowledge representation, reasoning, and learning.",
        "prereqs": "Graduate Semester level CS 6601 Minimum Grade of D",
        "title": "AI Problem Solving"
    },
    "CS 7612": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Symbolic numerical techniques that allow intelligent systems to decide how they should act in order to achieve their goals, including action and plan representation, plan synthesis and reasoning, analysis of planning algorithms, plan execution and monitoring, plan reuse and learning, and applications.",
        "prereqs": "Graduate Semester level CS 6601 Minimum Grade of D",
        "title": "AI Planning"
    },
    "CS 7613": {
        "category": "Intelligence",
        "credit": 0.0,
        "description": "Techniques for constructing large knowledge-based systems. Advanced symbolic AI techniques. Constraint systems.",
        "prereqs": "Graduate Semester level CS 6601 Minimum Grade of D",
        "title": "Knowledge Systems Engr"
    },
    "CS 7615": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Knowledge-based interactive systems, knowledge-based autonomous agents, agent architectures, learning and adaptation, agent evolution.",
        "prereqs": "Undergraduate Semester level CS 4600 Minimum Grade of D",
        "title": "Knowledge Agents"
    },
    "CS 7616": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "This course provides an introduction to the theory and practice of pattern recognition. It emphasizes unifying concepts and the analysis of real-world datasets.",
        "prereqs": "",
        "title": "Pattern Recognition"
    },
    "CS 7620": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Topics include case representation, indexing and retrieval, adaptation, interpretive CBR, the cognitive model that CBR implies, and its implications for creativity, decision aiding, and education. Credit not allowed for both CS 7620 and CS 4622.",
        "prereqs": "Undergraduate Semester level CS 4600 Minimum Grade of D",
        "title": "Case-Based Reasoning"
    },
    "CS 7626": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "An introduction to the use of sensor data and machine learning methods to measure and model human behavior objectively and automatically for health applications.",
        "prereqs": "",
        "title": "Behavioral Imaging"
    },
    "CS 7630": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "The principles and practice of autonomous robotics including behavior-based design and architectures, adaptive learning and team behavior, and the role of perception within robotic systems.",
        "prereqs": "Undergraduate Semester level CS 4600 Minimum Grade of D",
        "title": "Autonomous Robotics"
    },
    "CS 7631": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "In-depth examination of the current research on multi-robot systems. Students develop and critically analyze a multi-robot system.",
        "prereqs": "Undergraduate Semester level CS 4631 Minimum Grade of D or Graduate Semester level CS 7630 Minimum Grade of D",
        "title": "Multi-Robot Systems"
    },
    "CS 7632": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "An exploration of how artificial intelligence is used in modern digital computer games. Credit will not be awarded for CS 7632 and CS 4731, CS 7632 and LCC 4731 or CS 7632 and LMC 4731.",
        "prereqs": "Graduate Semester level CS 6601 Minimum Grade of D",
        "title": "Game AI"
    },
    "CS 7633": {
        "category": "People",
        "credit": 3.0,
        "description": "Survey of the state of the art in HRI research, introduction to statistical methods for HRI research, research project studio.",
        "prereqs": "",
        "title": "Human-Robot Interaction"
    },
    "CS 7634": {
        "category": "People",
        "credit": 3.0,
        "description": "An exploration of how artificial intelligence can enable us to use stories in virtual worlds for the purpose of entertaining, educatintg, and training human users.",
        "prereqs": "",
        "title": "AI Storytell In Vir Wrld"
    },
    "CS 7636": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Study of statistical and algorithmic methods for sensing people using video and audio. Topics include face detection and recognition, figure tracking, and audio-visual sensing.",
        "prereqs": "Undergraduate Semester level CS 4641 Minimum Grade of D and (Undergraduate Semester level CS 4495 Minimum Grade of D or Graduate Semester level CS 7495 Minimum Grade of D)",
        "title": "Computational Perception"
    },
    "CS 7637": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Structured knowledge representation; knowledge-based methods of reasoning and learning; problem-solving, modeling and design.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of D",
        "title": "Knowledge-Based AI"
    },
    "CS 7638": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "AI techniques with applications to autonomous vehicles. Extensive programming exercises. Topics include probabilistic inference, Kalman/particle filters, planning/search algorithms, PID control, SLAM.",
        "prereqs": "",
        "title": "Robotics: AI Techniques"
    },
    "CS 7639": {
        "category": "Info Internetworks",
        "credit": 3.0,
        "description": "Cyber Physical Systems (CPS), including examples. Design methods. Formalisms: Different equations, finite-state machines. Analysis. Formal methods. Design processes, Model-Based Systems Engineering, Reference documents and regulations.",
        "prereqs": "",
        "title": "Cyber Physical Design"
    },
    "CS 7640": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "An in-depth look at agents that learn, including intelligent systems, robots, and humans. Design and implementation of computer models of learning and adaptation in autonomous intelligent agents.",
        "prereqs": "Undergraduate Semester level CS 4600 Minimum Grade of D or Graduate Semester level CS 4641 Minimum Grade of D",
        "title": "Learning in Auton Agents"
    },
    "CS 7641": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Machine learning techniques and applications. Topics include foundational issues; inductive, analytical, numerical, and theoretical approaches; and real-world applications. Credit not awarded for both CS 7641 and CS 4641/CSE 6740/ISYE 6340.",
        "prereqs": "Graduate Semester level CS 6601 Minimum Grade of D",
        "title": "Machine Learning"
    },
    "CS 7642": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Efficient algorithms for multiagent planning, and approaches to learning near-optimal decisions using possibly partially observable Markov decision processes; stochastic and repeated games; and reinforcement learning.",
        "prereqs": "",
        "title": "Reinforcement Learning"
    },
    "CS 7643": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "This course will cover theory and practice of deep learning, including neural network and structured models, optimization algorithms, and applications to perception and Artificial Intelligence.",
        "prereqs": "Graduate Semester level CSE 6740 Minimum Grade of D or Graduate Semester level ISYE 6740 Minimum Grade of D or Graduate Semester level CS 7641 Minimum Grade of D",
        "title": "Deep Learning"
    },
    "CS 7644": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Overview of a portfolio of machine learning techniques useful for robotic application: from regression to deep learning, applied on simulated real-time mobile robotic applications.",
        "prereqs": "",
        "title": "ML For Robotics"
    },
    "CS 7645": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "This course explores problems in classification/pattern recognition (OCR, speech, vision, fault detection, medical diagnosis), regression/function approximation, robot control, and reinforcement learning.",
        "prereqs": "Undergraduate Semester level CS 4641 Minimum Grade of D",
        "title": "Num Machine Learning"
    },
    "CS 7646": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Introduces machine learning based trading strategies. Topics: Information processing, probabilistic analysis, portfolio construction, generation of market orders, KNN, random forests. Credit not awarded for both CS 4646 and CS 7646.",
        "prereqs": "",
        "title": "Mach Learn For Trading"
    },
    "CS 7648": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "This course combines lectures in CS (Machine and Reinforcement Learning) and CogSci with a research seminar to enable students to develop learning from demonstration systems.",
        "prereqs": "",
        "title": "Interactive Robo Learn"
    },
    "CS 7649": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "We investigate algorithms for robots and complex systems that make intelligent decisions. Emphasis on the theoretical and empirical properties of classical, geometric, stochastic/dynamic planning.",
        "prereqs": "",
        "title": "Robot Intelli: Planning"
    },
    "CS 7650": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Topics include lexical analysis, parsing, interpretation of sentences, semantic representation, organization of knowledge, inference mechanisms. Newer approaches combining statistical language processing and information retrieval techniques. Credit not allowed for both CS 7650 and CS 4650.",
        "prereqs": "Undergraduate Semester level CS 3600 Minimum Grade of D",
        "title": "Natural Language"
    },
    "CS 7695": {
        "category": "People",
        "credit": 3.0,
        "description": "Examines problems in the foundations of cognition in relation to current issues in cognitive sciences. Topics include meaning, mental imagery, consciousness, and mind/body problem.",
        "prereqs": "",
        "title": "Phil of Cognition"
    },
    "CS 7697": {
        "category": "People",
        "credit": 3.0,
        "description": "Examines how models of reasoning and representation developed in the cognitive sciences can provide a basis for an enriched understanding of scientific theories and research practices in science and technology.",
        "prereqs": "",
        "title": "Cognitive Model Sci&Tech"
    },
    "CS 7741": {
        "category": "Intelligence",
        "credit": 1.0,
        "description": "Preparation for a professional career in Robotics. Local & visiting speakers. Program introduction. Technical resume preparation. GT Robotics labs & resources.",
        "prereqs": "",
        "title": "Robotics Pro Prep 1"
    },
    "CS 7742": {
        "category": "Intelligence",
        "credit": 1.0,
        "description": "Preparation for a professional career in Robotics. Local & visiting speakers. Selecting and applying for Internship. Developing capstone project proposal. Public speaking practice and preparation.",
        "prereqs": "",
        "title": "Robo Pro Prep 2"
    },
    "CS 7743": {
        "category": "Intelligence",
        "credit": 1.0,
        "description": "Preparation for a professional career in Robotics. Local & visiting speakers. Interview preparation & career search. Technical report writing and presentation.",
        "prereqs": "",
        "title": "Robo Pro Prep 3"
    },
    "CS 7750": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Provides the mathematical background for two of the pillars of modern data science: linear algebra and applied probability.",
        "prereqs": "",
        "title": "Math Fnd Of Machine Lrn"
    },
    "CS 7751": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "The course provides an introduction to theory and practice of graphical models in machine learning. It covers three main aspects; representation, probabilistic inference, and learning.",
        "prereqs": "(Undergraduate Semester level ECE 3077 Minimum Grade of C or Undergraduate Semester level ISYE 3770 Minimum Grade of C or Undergraduate Semester level MATH 3670 Minimum Grade of C) and (Undergraduate Semester level CS 1371 Minimum Grade of C or Undergraduate Semester level CS 1301 Minimum Grade of C)",
        "title": "Graphical Models in ML"
    },
    "CS 7785": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Familiarizes students with the core areas of robotics; mechanics, control, perception, AI, and autonomy. Provides an introduction to the mathematical tools required in robotics research.",
        "prereqs": "",
        "title": "Intro Robotics Research"
    },
    "CS 7790": {
        "category": "People",
        "credit": 0.0,
        "description": "A hands-on course covering a range of cognitive modeling methodologies. It explores the analysis, development, construction, and evaluation of models of cognitive processing. Crosslisted with ISYE and PSYC 7790.",
        "prereqs": "Graduate Semester level CS 6795 Minimum Grade of D or Graduate Semester level ISYE 6795 Minimum Grade of D or Graduate Semester level PSYC 6795 Minimum Grade of D",
        "title": "Cognitive Modeling"
    },
    "CS 7999": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Consent of the College required.",
        "prereqs": "",
        "title": "Prep-Doctoral Qual Exams"
    },
    "CS 8001": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Group discussion of advanced topics in information and computer science. May not be used by computer science majors for degree credit.",
        "prereqs": "",
        "title": "Seminar"
    },
    "CS 8002": {
        "category": "Miscellaneous",
        "credit": 2.0,
        "description": "Group discussion of advanced topics in information and computer science. May not be used by computer science majors for degree credit.",
        "prereqs": "",
        "title": "Seminar"
    },
    "CS 8003": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Group discussion of advanced topics in information and computer science. May not be used by computer science majors for degree credit.",
        "prereqs": "",
        "title": "Seminar"
    },
    "CS 8004": {
        "category": "Miscellaneous",
        "credit": 4.0,
        "description": "Group discussion of advanced topics in information and computer science. May not be use by computer science majors for degree credit.",
        "prereqs": "",
        "title": "Seminar"
    },
    "CS 8005": {
        "category": "Miscellaneous",
        "credit": 5.0,
        "description": "Group discussion of advanced topics in information and computer science. May not be used by computer science majors for degree credit.",
        "prereqs": "",
        "title": "Seminar"
    },
    "CS 8006": {
        "category": "Miscellaneous",
        "credit": 6.0,
        "description": "Group discussion of advanced topics in information and computer science. May not be used by computer science majors for degree credit.",
        "prereqs": "",
        "title": "Seminar"
    },
    "CS 8030": {
        "category": "Systems & Architecture",
        "credit": 1.0,
        "description": "This seminar provides students with an opportunity to explore contemporary topics in software engineering.",
        "prereqs": "",
        "title": "Software Engr Seminar"
    },
    "CS 8740": {
        "category": "Intelligence",
        "credit": 1.0,
        "description": "Graduate Internship at a partner company, GTRI or a GT Robotics lab.",
        "prereqs": "",
        "title": "Robotics Internship"
    },
    "CS 8741": {
        "category": "Intelligence",
        "credit": 3.0,
        "description": "Teams or individuals apply the knowledge and skills acquired throughout the MS program to a faculty supervised robotics project.",
        "prereqs": "",
        "title": "Robo Capstone Project"
    },
    "CS 8750": {
        "category": "Intelligence",
        "credit": 0.0,
        "description": "Multidisciplinary research course supervised by two robotics faculty from different schools participating in the robotics Ph.D. program.",
        "prereqs": "Graduate Semester level AE 7785 Minimum Grade of D or Graduate Semester level CS 7785 Minimum Grade of D or Graduate Semester level ECE 7785 Minimum Grade of D or Graduate Semester level ME 7785 Minimum Grade of D",
        "title": "Robotics Research Fnd I"
    },
    "CS 8751": {
        "category": "Intelligence",
        "credit": 0.0,
        "description": "Continuation of AE 8751 (Robotics Research Foundation I).",
        "prereqs": "Graduate Semester level AE 8750 Minimum Grade of D or Graduate Semester level CS 8750 Minimum Grade of D or Graduate Semester level ECE 8750 Minimum Grade of D or Graduate Semester level ME 8750 Minimum Grade of D",
        "title": "Robotics Research Fnd II"
    },
    "CS 8795": {
        "category": "People",
        "credit": 1.0,
        "description": "Reading of research papers by leading cognitive scientists, attendance at their colloquia and meeting with them to discuss research. Crosslisted with ISYE and PSYC 8795.",
        "prereqs": "",
        "title": "Colloquium-Cognitive Sci"
    },
    "CS 8801": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Special topics of current interest. Treatment of new developments in various areas of computing.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8802": {
        "category": "Miscellaneous",
        "credit": 2.0,
        "description": "Special topics of current interest. Treatment of new developments in various areas of computing.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8803": {
        "category": "Miscellaneous",
        "credit": 3.0,
        "description": "Special topics of current interest. Treatment of new developments in various areas of computing.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8804": {
        "category": "Miscellaneous",
        "credit": 4.0,
        "description": "Special topics of current interest. Treatment of new developments in various areas of computing.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8805": {
        "category": "Miscellaneous",
        "credit": 5.0,
        "description": "Special topics of current interest. Treatment of new developments in various areas of computing.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8806": {
        "category": "Miscellaneous",
        "credit": 6.0,
        "description": "Special topics of current interest. Treatment of new developments in various areas of computing.",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8811": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Special Topics in CS - Lab",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8873": {
        "category": "Miscellaneous",
        "credit": 0.0,
        "description": "",
        "prereqs": "",
        "title": "Special Topics"
    },
    "CS 8893": {
        "category": "People",
        "credit": 3.0,
        "description": "Topics of current interest in cognitive science.",
        "prereqs": "",
        "title": "Spec Top-Cognitive Sci"
    },
    "CS 8901": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Small-group or individual investigation of advanced topics in computing. Guided study and research.",
        "prereqs": "",
        "title": "Special Problems"
    },
    "CS 8902": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Small-group or individual investigation of advanced topics in computing. Guided study and research.",
        "prereqs": "",
        "title": "Special Problems"
    },
    "CS 8903": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Small-group or individual investigation of advanced topics in computing. Guided study and research.",
        "prereqs": "",
        "title": "Special Problems"
    },
    "CS 8997": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "For graduate students holding graduate teaching assistantships.",
        "prereqs": "",
        "title": "Teaching Assistantship"
    },
    "CS 8998": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "For graduate students holding graduate research assistantships.",
        "prereqs": "",
        "title": "Research Assistantship"
    },
    "CS 8999": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Doctoral Thesis Preparation Prerequisite: consent of the College.",
        "prereqs": "",
        "title": "Doctoral Thesis Prep"
    },
    "CS 9000": {
        "category": "Miscellaneous",
        "credit": 1.0,
        "description": "Doctoral Thesis Prerequisite: consent of the College.",
        "prereqs": "",
        "title": "Doctoral Thesis"
    },
    "MATH 1111": {
        "description": "Study of the properties of algebraic, exponential, and logarithmic functions as needed for pre-calculus and calculus.",
        "extra": "",
        "credit": "4",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18",
        "prereqs": "None.",
        "schedule": "Every spring and fall semesters",
        "title": "College Algebra"
    },
    "MATH 1113": {
        "description": "Analytic geometry, the function concept, polynomials, exponential, logarithms, trigonometric functions, mathematical induction, the theory of equations.",
        "extra": "",
        "credit": "4",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "Math 1111 with a minimum grade of D or Math SAT Section Score (new SAT) of 530 or ACT score of 21.",
        "schedule": "Every spring and fall semesters",
        "title": "Precalculus"
    },
    "MATH 1501": {
        "description": "See MATH 1551 and new math core for Fall 2015. Differential calculus and basic integral calculus including the fundamental theorem of calculus, including the underlying theory of limits for functions and sequences.",
        "extra": "New Math Core Fall 2015.",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "Math SAT score of 600 or higher, or MATH 1113 Precalculus.",
        "schedule": "Not offered after Summer 2015",
        "title": "Calculus I"
    },
    "MATH 1502": {
        "description": "See MATH 1552, 1553, 1554, 1564. Concludes the treatment of single variable calculus, and begins linear algebra; the linear basis of the multivariable theory. The first 1/3 of this course covers more advanced single variable calculus. The remaining 2/3 is an introduction to linear algebra, the theory of linear equations in several variables.",
        "extra": "New Math Core Fall 2015.",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "MATH 1501.",
        "schedule": "Not offered after Spring 2016",
        "title": "Calculus II"
    },
    "MATH 1503": {
        "description": "Single variable differential and integral calculus: sequences and difference equations, limit and continuity, differentiation and integration and applications. The topics covered parallel those of MATH 1501 but the applications and examples are drawn from life sciences instead of physical sciences.",
        "extra": "",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "Math SAT score 600 or higher, or converted ACT Math 600 or higher, or MATH 1113 Precalculus minimum grade of D.",
        "schedule": "Every Fall Semester",
        "title": "Calculus I for Life Sciences"
    },
    "MATH 1504": {
        "description": "Taylor approximations, introduction to differential equations, linear algebra and introduction to multivariable calculus. Motivating examples drawn from life sciences.",
        "extra": "",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "MATH 1503 or MATH 1501 or MATH 1511 or MATH 15X1.",
        "schedule": "Every Spring Semester",
        "title": "Calculus II for Life Sciences"
    },
    "MATH 1512": {
        "description": "This course is designed for students who have had a serious single variable calculus course in high school.",
        "extra": "Non-HP Section - AP Calculus BC score of 5, must apply in July",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "HP Section - for Honors Program students only",
        "schedule": "Every fall",
        "title": "Honors Calculus II"
    },
    "MATH 1522": {
        "description": "Will be replaced by MATH 1553. See also MATH 1554, 1564. Transfer students with credit for MATH 15X2 (Transfer Calculus II) should take MATH 1522 to satisfy the linear algebra requirement in MATH 1502.",
        "extra": "New Math Core Fall 2015.",
        "credit": "2",
        "offered": "Not currently offered",
        "prereqs": "MATH 15X2",
        "schedule": "Not offered after Summer 2015",
        "title": "Introduction to Linear Algebra for Calculus"
    },
    "MATH 1550": {
        "description": "An introduction to differential calculus including the theory of limits for functions and sequences (only for Summer Freshmen).",
        "extra": "",
        "credit": "3",
        "offered": "su21, su20, su19, su18",
        "prereqs": "SAT Math score of 600 or Math SAT Section Score (new SAT) of 620 or ACT 26 or ACT equivalent 600 or MATH 1113 Precalculus.",
        "schedule": "Every Summer",
        "title": "Introduction to Differential Calculus"
    },
    "MATH 1551": {
        "description": "Differential calculus including applications and the underlying theory of limits for functions and sequences.",
        "extra": "",
        "credit": "2",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "Math SAT Section Score (new SAT) of 620 or ACT 26 or ACT equivalent 600 or MATH 1113 Precalculus.",
        "schedule": "Every Semester",
        "title": "Differential Calculus"
    },
    "MATH 1552": {
        "description": "Definite and indefinite integrals, techniques of integration, improper integrals, infinite series, applications.",
        "extra": "",
        "credit": "4",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 1550 or MATH 1551 or MATH 1501 or MATH 15X1 or MATH 1X51.",
        "schedule": "Every Semester",
        "title": "Integral Calculus"
    },
    "MATH 1553": {
        "description": "An introduction to linear algebra through eigenvalues and eigenvectors, applications to linear systems, least squares.",
        "extra": "MATH 1553, MATH 1554, and MATH 1564 are equivalent and only one can be taken for credit. Note: MATH 4305 cannot be used for credit in the BS MTH degree.",
        "credit": "2",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "Math SAT Section Score (new SAT) of 620 or ACT 26 or ACT equivalent 600 or MATH 1113 Precalculus or 15X2 or 1X52 or MATH 1552 Integral Calculus.",
        "schedule": "Every Semester",
        "title": "Introduction to Linear Algebra"
    },
    "MATH 1554": {
        "description": "Linear algebra through eigenvalues, eigenvectors, applications to linear systems, least squares, diagonalization, quadratic forms.",
        "extra": "MATH 1553, MATH 1554, and MATH 1564 are equivalent and only one can be taken for credit.\nNote: MATH 4305 cannot be used for credit in the BS MTH degree.",
        "credit": "4",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "Math SAT Section Score (new SAT) of 620 or ACT 26 or ACT equivalent 600 or MATH 1113 Precalculus or 15X2 or 1X52 or MATH 1552 Integral Calculus.",
        "schedule": "Every Semester",
        "title": "Linear Algebra"
    },
    "MATH 1555": {
        "description": "Overview of integral calculus, multivariable calculus, and differential equations for biological sciences. This course is required for students in School of Biology.",
        "extra": "",
        "credit": "4",
        "offered": "sp21, sp20, sp19, sp18, sp16",
        "prereqs": "MATH 1550 or MATH 1551 or MATH 1501 or MATH 15X1 or MATH 1X51",
        "schedule": "Every Spring Semester",
        "title": "Calculus for Life Sciences"
    },
    "MATH 1564": {
        "description": "This is an intensive course on linear algebra, taught at a sophisticated and abstract level.",
        "extra": "MATH 1553, MATH 1554, and MATH 1564 are equivalent and only one can be taken for credit.\nNote: MATH 4305 cannot be used for credit in the BS MTH degree.",
        "credit": "4",
        "offered": "fa21, fa20, fa19, fa18, su18, sp18, fa17",
        "prereqs": "Score of 5 in AP BC Calculus or A in MATH 1552 or equivalent or permission from Academic Office.",
        "schedule": "Every Fall",
        "title": "Linear Algebra with Abstract Vector Spaces"
    },
    "MATH 1711": {
        "description": "Linear equations, matrices, linear programming, sets and counting, probability and statistics.",
        "extra": "",
        "credit": "4",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "Math SAT Section Score (new SAT) of 570 or ACT 24 or ACT equivalent 550, or MATH 1113 Precalculus.",
        "schedule": "Every semester",
        "title": "Finite Mathematics"
    },
    "MATH 1712": {
        "description": "Functions, the derivative, applications of the derivative, techniques of differentiation, integration, applications of integration to probability and statistics, multidimensional calculus.",
        "extra": "",
        "credit": "4",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "Math SAT Section Score (new SAT) of 570 or ACT 24 or ACT equivalent 550, or MATH 1113 Precalculus.",
        "schedule": "Every Semester",
        "title": "Survey of Calculus"
    },
    "MATH 2106": {
        "description": "An introduction to proofs in advanced mathematics, intended as a transition to upper division courses including MATH 4107, 4150 and 4317. Fundamentals of mathematical abstraction including sets, logic, equivalence relations, and functions. Thorough development of the basic proof techniques: direct, contrapositive, existence, contradiction, and induction. Introduction to proofs in analysis and algebra.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "((MATH 1552 or MATH 15X2 or MATH 1X52) and (MATH 1553 or MATH 1554 or MATH 1564 or MATH 1522 or MATH 1X53))",
        "schedule": "Fall and Spring semesters",
        "title": "Foundations of Mathematical Proof"
    },
    "MATH 2401": {
        "description": "Being replaced by MATH 2551. Multivariable calculus: Linear approximation and Taylor's theorems, Lagrange multiples and constrained optimization, multiple integration and vector analysis including the theorems of Green, Gauss and Stokes.",
        "extra": "New Math Core Fall 2015.",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "MATH 1502.",
        "schedule": "Not offered after Summer 2015",
        "title": "Calculus III"
    },
    "MATH 2403": {
        "description": "Course being replaced by MATH 2552. Methods for obtaining numerical and analytic solutions of elementary differential equations. Applications are also discussed with an emphasis on modeling.",
        "extra": "\nNew Math Core Fall 2015",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "MATH 1502",
        "schedule": "Not offered after Summer 2015",
        "title": "Differential Equations"
    },
    "MATH 2406": {
        "description": "A thorough development of the theory of linear algebra and an introduction to multilinear algebra, with selected applications.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 1502",
        "schedule": "Not regularly scheduled",
        "title": "Abstract Vector Spaces"
    },
    "MATH 2411": {
        "description": "The topics covered parallel those of 2401 with a somewhat more intensive and rigorous treatment. Credit is not allowed for both an honors calculus course and the corresponding regular calculus course.",
        "extra": "",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "You must have a B or higher in MATH 1502 or MATH 1512 to be enrolled in this course. If you are in MATH 1502 or MATH 1512 in the fall term, you may register for this course during Phase I of registration. In December, we will drop any students in 2411 who make C, D or F in 1502 or 1512.",
        "schedule": "Every spring",
        "title": "Honors Calculus III"
    },
    "MATH 2413": {
        "description": "Methods for obtaining numerical and analytic solutions of elementary differential equations. Applications are also discussed with an emphasis on modeling.",
        "extra": "",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "You must have a B or higher in MATH 2401, MATH 2411, or MATH 2605 to take this course.",
        "schedule": "No regular schedule",
        "title": "Honors Differential Equations"
    },
    "MATH 2550": {
        "description": "An introduction to multivariable calculus through vectors in 3D, curves, functions of several variables, partial derivatives, min/max problems, multiple integration. Vector Calculus not covered.",
        "extra": "",
        "credit": "2",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "schedule": "Every Semester",
        "title": "Introduction to Multivariable Calculus"
    },
    "MATH 2551": {
        "description": "Linear approximation and Taylor’s theorems, Lagrange multiples and constrained optimization, multiple integration and vector analysis including the theorems of Green, Gauss, and Stokes.",
        "extra": "Equivalent to MATH 2401.",
        "credit": "4",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "schedule": "Every Semester",
        "title": "Multivariable Calculus"
    },
    "MATH 2552": {
        "description": "Methods for obtaining numerical and analytic solutions of elementary differential equations. Applications are also discussed with an emphasis on modeling.",
        "extra": "Equivalent to MATH 2403.",
        "credit": "4",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "schedule": "Every Semester",
        "title": "Differential Equations"
    },
    "MATH 2561": {
        "description": "The topics covered parallel those of MATH 2551 with a somewhat more intensive and rigorous treatment.",
        "extra": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53)).\nIf you are currently taking the perequisite course in the fall, you may register for this course during Phase I of registration. In December, we will drop any students in MATH 2561 who make C, D or F in the prerequisite course.",
        "credit": "4",
        "offered": "sp19, sp18",
        "prereqs": "Grade at least B in the following:",
        "schedule": "Usually every Spring Semester",
        "title": "Honors Multivariable Calculus"
    },
    "MATH 2562": {
        "description": "The topics covered parallel those of MATH 2552 with a somewhat more intensive and rigorous treatment.",
        "extra": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "credit": "4",
        "offered": "fa19, fa18, fa17",
        "prereqs": "Grade at least B in the following:",
        "schedule": "Usually every Fall Semester",
        "title": "Honors Differential Equations"
    },
    "MATH 2602": {
        "description": "The course is being replaced in Fall 2015 by the equivalent course MATH 2603, Intro to Discrete Math. Mathematical logic and proof, mathematical induction, counting methods, recurrence relations, algorithms and complexity, graph theory and graph algorithms.",
        "extra": "New Math Core Fall 2015.",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "MATH 2401 or MATH 2411",
        "schedule": "Not offered after Summer 2015",
        "title": "Linear and Discrete Mathematics"
    },
    "MATH 2603": {
        "description": "Mathematical logic and proof, mathematical induction, counting methods, recurrence relations, algorithms and complexity, graph theory and graph algorithms.",
        "extra": "This course is equivalent to MATH 2602.",
        "credit": "4",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 1552 or MATH 1502 or MATH 1512 or MATH 15X2.",
        "schedule": "Every Semester",
        "title": "Introduction to Discrete Mathematics"
    },
    "MATH 2605": {
        "description": "Topics in linear algebra and multivariate calculus and their applications in optimization and numerical methods, including curve fitting, interpolation, and numerical differentiation and integration.",
        "extra": "",
        "credit": "4",
        "offered": "Not currently offered",
        "prereqs": "MATH 1502 or MATH 1512 or (Math 15X2 + MATH 1522)",
        "schedule": "Not regularly scheduled",
        "title": "Calculus III for Computer Science"
    },
    "MATH 2802 LEY": {
        "description": "Special Topics course offered in Spring 2017 by Anton Leykin. Restricted to CS students with credit for MATH 1553, MATH 1502 or MATH 1522.",
        "extra": "",
        "credit": "2",
        "offered": "Not currently offered",
        "prereqs": "MATH 1553, MATH 1502 or MATH 1522",
        "schedule": "Not regularly scheduled",
        "title": "Applications of Linear Algebra"
    },
    "MATH 2802-ALG": {
        "description": "Special Topics course offered in Spring 2017 by TBA. Restricted to CS students with credit for MATH 1553, MATH 1502 or MATH 1522.",
        "extra": "",
        "credit": "2",
        "offered": "sp19, sp18",
        "prereqs": "MATH 1553, MATH 1502 or MATH 1522",
        "schedule": "Not currently offered",
        "title": "Applications of Linear Algebra"
    },
    "MATH 3012": {
        "description": "Elementary combinatorial techniques used in discrete problem solving: counting methods, solving linear recurrences, graph and network models, related algorithms, and combinatorial designs.",
        "extra": "CS students should complete CS 2050 before taking MATH 3012.",
        "credit": "3",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "schedule": "Every semester",
        "title": "Applied Combinatorics"
    },
    "MATH 3215": {
        "description": "This course is a problem oriented introduction to the basic concepts of probability and statistics, providing a foundation for applications and further study.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 2401 or MATH 24X1 or MATH 2411 or MATH 2551 or MATH 2561 or MATH 2550 or MATH 2X51 or MATH 2605.",
        "schedule": "Every semester",
        "title": "Introduction to Probability and Statistics"
    },
    "MATH 3225": {
        "description": "The topics covered parallel those of MATH 3215, with a more rigorous and intensive treatment. Credit is not allowed for both MATH 3215 and 3225.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "You must have B or higher in MATH 2401, MATH 2411, or MATH 2605 or MATH 2551 or MATH 2561 to be enrolled in this course.  If you are in one of the above courses in the spring or summer term, you may register for MATH 3225 during Phase I of registration. In early August, we will drop any students in 3225 (fall term) who make C, D, or F in 2401, 2411, 2605, 2551 or 2561 in the spring or summer term.",
        "schedule": "Not currently offered",
        "title": "Honors Probability and Statistics"
    },
    "MATH 3235": {
        "description": "This course is a mathematical introduction to probability theory, covering random variables, moments, multivariate distributions, law of large numbers, central limit theorem, and large deviations.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "(MATH 2551 or MATH 2X51 or MATH 2561 or MATH 2401 or MATH 24X1 or MATH 2411 or MATH 2605 or MATH 2550) AND (MATH 2106 or CS 2051 or MATH 3012)",
        "schedule": "Fall and Spring Semesters",
        "title": "Probability Theory"
    },
    "MATH 3236": {
        "description": "This course is an introduction to theoretical statistics for students with a background in probability. A mathematical formalism for inference on experimental data will be developed.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18",
        "prereqs": "MATH 3235 Introduction to Probability",
        "schedule": "Spring Semester",
        "title": "Statistical Theory"
    },
    "MATH 3406": {
        "description": "This course will cover important topics in linear algebra not usually discussed in a first-semester course, featuring a mixture of theory and applications.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "MATH 1553 or MATH 1554 or MATH 1564 or MATH 1502 or MATH 1512 or MATH 1522 or MATH 1X53",
        "schedule": "Every Spring and Fall Semesters",
        "title": "A Second Course on Linear Algebra"
    },
    "MATH 3670": {
        "description": "Introduction to probability, probability distributions, point estimation, confidence intervals, hypothesis testing, linear regression and analysis of variance.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 2401 or MATH 24X1 or MATH 2411 or MATH 2551 or MATH 2550 or MATH 2X51",
        "schedule": "Every Semester",
        "title": "Probability and Statistics with Applications"
    },
    "MATH 3770": {
        "description": "Introduction to probability, probability distributions, point estimation, confidence intervals, hypothesis testing, linear regression and analysis of variance.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 2401",
        "schedule": "Not offered any more. Replaced by MATH 3670.",
        "title": "Statistics and Applications"
    },
    "MATH 4012": {
        "description": "Introduction to linear error correcting codes with an emphasis on the algebraic tools required, including matrices, vector spaces, groups, polynomial rings, and finite fields.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 1502",
        "schedule": "no regular schedule",
        "title": "Algebraic Structures in Coding Theory"
    },
    "MATH 4022": {
        "description": "The fundamentals of graph theory: trees, connectivity, Euler torus, Hamilton cycles, matchings, colorings and Ramsey theory.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 3012 or equivalent",
        "schedule": "Every fall semester",
        "title": "Introduction to Graph Theory"
    },
    "MATH 4032": {
        "description": "Combinatorial problem-solving techniques including the use of generating functions, recurrence relations, Polya theory, combinatorial designs, Ramsey theory, matroids, and asymptotic analysis.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18",
        "prereqs": "MATH 3012 or equivalent",
        "schedule": "Every spring semester",
        "title": "Combinatorial Analysis"
    },
    "MATH 4080": {
        "description": "The first of a two course sequence of faculty-directed independent research culminating in the writing of a senior thesis and its presentation.",
        "extra": "",
        "credit": "2",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "MATH 3012",
        "schedule": "Every fall and spring semesters",
        "title": "Senior Project I"
    },
    "MATH 4090": {
        "description": "The second of a two course sequence of faculty-directed independent research culminating in the writing of a senior thesis and its presentation.",
        "extra": "",
        "credit": "2",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "MATH 3012",
        "schedule": "Every fall and spring semesters",
        "title": "Senior Project II"
    },
    "MATH 4107": {
        "description": "This course develops in the theme of \"Arithmetic congruence, and abstract algebraic structures.\" There will be a very strong emphasis on theory and proofs.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "MATH 2406 or MATH 2106",
        "schedule": "Every fall and spring semesters",
        "title": "Abstract Algebra I"
    },
    "MATH 4108": {
        "description": "Continuation of Abstract Algebra I, with emphasis on Galois theory, modules, polynomial fields, and the theory of linear associative algebra.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18",
        "prereqs": "MATH 4107",
        "schedule": "Every spring",
        "title": "Abstract Algebra II"
    },
    "MATH 4150": {
        "description": "Primes and unique factorization, congruences, Chinese remainder theorem, Diophantine equations, Diophantine approximations, quadratic reciprocity. Applications such as fast multiplication, factorization and encryption.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18",
        "prereqs": "MATH 2406 or MATH 2106 or CS 3510 or CS 3511",
        "schedule": "Every spring semester",
        "title": "Introduction to Number Theory"
    },
    "MATH 4221": {
        "description": "Simple random walk and the theory of discrete time Markov chains",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "MATH 3215 or MATH 3225 or MATH 3235 or MATH 3670 or MATH 3770 or ISYE 3770 or CEE 3770",
        "schedule": "Typically every fall semester",
        "title": "Stochastic Processes I"
    },
    "MATH 4222": {
        "description": "Renewal theory, Poisson processes and continuous time Markov processes, including an introduction to Brownian motion and martingales",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 4221",
        "schedule": "Not currently offered",
        "title": "Stochastic Processes II"
    },
    "MATH 4255": {
        "description": "Topics include uniform random number generation, sampling from non-uniform distributions, and applications to stochastic simulation, simulated annealing and genetic algorithms. A review of basic probability and Markov chains makes the course largely self-contained.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 3215 or MATH 3225 or MATH 3235 or MATH 3770 or ISYE 3770 or CEE 3770",
        "schedule": "no regular schedule",
        "title": "Monte Carlo Methods"
    },
    "MATH 4261": {
        "description": "Sampling distributions, Normal, t, chi-square and F distributions. Moment generating function methods, Bayesian estimation and introduction to hypothesis testing",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "MATH 3215 or MATH 3225 or MATH 3235 or MATH 3670 or MATH 3770 or ISyE 3770 or CEE 3700",
        "schedule": "Every fall semester",
        "title": "Mathematical Statistics I"
    },
    "MATH 4262": {
        "description": "Hypothesis testing, likelihood ratio tests, nonparametric tests, bivariate and multivariate normal distributions",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18",
        "prereqs": "MATH 4261",
        "schedule": "Every spring semester",
        "title": "Mathematical Statistics II"
    },
    "MATH 4280": {
        "description": "The measurement and quantification of information. These ideas are applied to the probabilistic analysis of the transmission of information over a channel along which random distortion of the message occurs.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18",
        "prereqs": "MATH 3215 or MATH 3225 or MATH 3235 or MATH 3670 or MATH 3770 or ISyE 3770 or CEE 3700",
        "schedule": "Every spring semester",
        "title": "Introduction to Information Theory"
    },
    "MATH 4305": {
        "description": "Linear algebra in R^n, standard Euclidean inner product in R^n, general linear spaces, general inner product spaces, least squares, determinants, eigenvalues and eigenvectors, symmetric matrices.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "schedule": "Every semester",
        "title": "Topics in Linear Algebra"
    },
    "MATH 4317": {
        "description": "Real numbers, topology of Euclidean spaces, Cauchy sequences, completeness, continuity and compactness, uniform continuity, series of functions, Fourier series",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "MATH 2106",
        "schedule": "Every Spring and Fall semester",
        "title": "Analysis I"
    },
    "MATH 4318": {
        "description": "Differentiation of functions of one real variable, Riemann-Stieltjes integral, the derivative in R^n and integration in R^n",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "MATH 4317",
        "schedule": "Spring only starting Spring 2020",
        "title": "Analysis II"
    },
    "MATH 4320": {
        "description": "Topics from complex function theory, including contour integration and conformal mapping",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17",
        "prereqs": "MATH 2401 or MATH 24X1 or MATH 2411 or MATH 2551 or MATH 2550 or MATH 2X51",
        "schedule": "Every spring and fall semester",
        "title": "Complex Analysis"
    },
    "MATH 4347": {
        "description": "Method of characteristics for first and second order partial differential equations, conservation laws and shocks, classification of second order systems and applications.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "(MATH 2403 or MATH 2413 or MATH 24X3 or MATH 2552 or MATH 2562 or MATH 2X52) and (MATH 1522 or MATH 1553 or MATH 1554 or MATH 1564 or MATH 1502 or MATH 1512)",
        "schedule": "Every fall semester",
        "title": "Partial Differential Equations I"
    },
    "MATH 4348": {
        "description": "Green's functions and fundamental solutions. Potential, diffusion and wave equations.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 4347",
        "schedule": "Not currently offered",
        "title": "Partial Differential Equations II"
    },
    "MATH 4431": {
        "description": "Point set topology, topological spaces and metric spaces, continuity and compactness, homotopy and covering spaces",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "MATH 4317",
        "schedule": "Every fall semester",
        "title": "Introduction to Topology"
    },
    "MATH 4432": {
        "description": "Introduction to algebraic methods in topology. Includes homotopy, the fundamental group, covering spaces, simplicial complexes. Applications to fixed point theory and group theory.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp19",
        "prereqs": "MATH 4317",
        "schedule": "Every odd spring semester",
        "title": "Introduction to Algebraic Topology"
    },
    "MATH 4441": {
        "description": "The theory of curves, surfaces, and more generally, manifolds. Curvature, parallel transport, covariant differentiation, Gauss-Bonet theorem",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "MATH 2401 or MATH 2411 or MATH 24X1 or MATH 2551 or MATH 2561 or MATH 2X51",
        "schedule": "Every fall semester",
        "title": "Differential Geometry"
    },
    "MATH 4541": {
        "description": "A broad introduction to the local and global behavior of nonlinear dynamical systems arising from maps and ordinary differential equations.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "(MATH 2403 or MATH 2413 or MATH 24X3 or MATH 2552 or MATH 2562 or MATH 2X52) and (MATH 1522 or MATH 1553 or MATH 1554 or MATH 1564 or MATH 1502 or MATH 1512)",
        "schedule": "Every fall semester",
        "title": "Dynamics and Bifurcations I"
    },
    "MATH 4542": {
        "description": "A continuation of Dynamics and Bifurcations I",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 4541",
        "schedule": "Not currently offered",
        "title": "Dynamics and Bifurcations II"
    },
    "MATH 4580": {
        "description": "A study of the linear programming problem, including the simplex method, duality, and sensitivity analysis with applications to matrix games, integer programming and networks.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp19",
        "prereqs": "MATH 1502 or MATH 1512 or (MATH 15X2 + MATH 1522)",
        "schedule": "Every odd spring",
        "title": "Linear Programming"
    },
    "MATH 4581": {
        "description": "Fourier series, Fourier integrals, boundary value problems for partial differential equations, eigenvalue problems",
        "extra": "",
        "credit": "3",
        "offered": "fa21, su21, sp21, fa20, su20, sp20, fa19, su19, sp19, fa18, su18, sp18, fa17",
        "prereqs": "MATH 2403 or MATH 2413 or MATH 24X3 or MATH 2552 or MATH 2562 or or MATH 2X52",
        "schedule": "Every semester",
        "title": "Classical Mathematical Methods in Engineering"
    },
    "MATH 4640": {
        "description": "Introduction to numerical algorithms for some basic problems in computational mathematics. Discussion of both implementation issues and error analysis. Crosslisted with CX 4640 (formerly CS 4642).",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, sp20, sp19, sp18",
        "prereqs": "MATH 2403 or MATH 2413 or MATH 24X3 or MATH 2552 or MATH 2562 or MATH 2X52 or MATH 2603",
        "schedule": "Every spring (MATH) and fall (CS)",
        "title": "Numerical Analysis I"
    },
    "MATH 4641": {
        "description": "Introduction to the numerical solution of initial and boundary value problems in differential equations.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 4640",
        "schedule": "Not currently offered",
        "title": "Numerical Analysis II"
    },
    "MATH 4755": {
        "description": "Problems from the life sciences and the mathematical methods for solving them are presented. The underlying biological and mathematical principles and the interrelationships are emphasized.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp19",
        "prereqs": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "schedule": "Every odd spring semester",
        "title": "Mathematical Biology"
    },
    "MATH 4777": {
        "description": "Scientific computational algorithms on vector and parallel computers. Speedup, algorithm complexity, interprocesses communication, synchronization, modern algorithms for linear systems, programming techniques, code optimization.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 1502 OR MATH 1512 OR MATH 1555 OR MATH 1504 ((MATH 1552 OR MATH 15X2 OR MATH 1X52) AND (MATH 1522 OR MATH 1553 OR MATH 1554 OR MATH 1564 OR MATH 1X53))",
        "schedule": "Not currently offered",
        "title": "Vector/Parallel Scientific Computing"
    },
    "MATH 4782": {
        "description": "Introduction to quantum computing and quantum information theory, formalism of quantum mechanics, quantum gates, algorithms, measurements, coding, and information. Physical realizations and experiments. Crosslisted with PHYS 4782",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18",
        "prereqs": "MATH 2401 or MATH 2411 or MATH 24X1 or MATH 2551 or MATH 2561 or MATH 2X51.",
        "schedule": "Fall semester (by Physics)",
        "title": "Quantum Information and Quantum Computing"
    },
    "MATH 4801 UG": {
        "description": "Pass/fail basis.\nThis course provides students with a broad exposure to areas of mathematics research through weekly speakers.",
        "extra": "",
        "credit": "1",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "MATH 2551, MATH 2550, MATH 2552, MATH 2401, or MATH 2411",
        "schedule": "Every Fall",
        "title": "Undergraduate Seminar"
    },
    "MATH 4802": {
        "description": "Pass/Fail basis. This course is intended to teach general mathematical problem solving skills, and to prepare students to take the Putnam Examination.",
        "extra": "",
        "credit": "2",
        "offered": "fa21, fa20, fa19, fa18, fa17",
        "prereqs": "None",
        "schedule": "Every Fall",
        "title": "Mathematical Problem Solving"
    },
    "MATH 4803 HP": {
        "description": "Special Topics course for the Honors Program offered in Spring 2017 by Matt Baker. Joint with MATH 2803 QHS, for Video High School students.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 1502 or MATH 1512 or MATH 1504 or MATH 1555 or ((MATH 1552 or MATH 15X2 or MATH 1X52) and (MATH 1553 or MATH 1554 or MATH 1564 or MATH 1522 or MATH 1X53))",
        "schedule": "Not regularly scheduled",
        "title": "Number Theory and Cryptography"
    },
    "MATH 4803 HP-LEY": {
        "description": "Special Topics course \"Bridge to Mathematics\" by Anton Leykin, for the Honors Program section and a general section, offered in Fall 2020.",
        "extra": "",
        "credit": "3",
        "offered": "fa20",
        "prereqs": "TBA",
        "schedule": "Not regularly scheduled",
        "title": "Bridge to Mathematics"
    },
    "MATH 4803 LEY - Sp16": {
        "description": "Special Topics course on Algebraic Computation and its Applications offered by Anton Leykin in Spring 2016.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 2406 or MATH 2106",
        "schedule": "Not regularly scheduled",
        "title": "Algebraic Computation and its Applications"
    },
    "MATH 4803-HOM": {
        "description": "Special topics course offered in Spring 2020 by Jennifer Hom.",
        "extra": "",
        "credit": "3",
        "offered": "sp20",
        "prereqs": "Math 1564 (Linear Algebra with Abstract Vector Spaces) or Math 2106 (Foundations of Mathematical Proof).",
        "schedule": "Not regularly scheduled",
        "title": "Knot Theory and Grid Homology"
    },
    "MATH 4803-HP-LEY": {
        "description": "Special topics course offered in Fall 2020 by Anton Leykin for the Honors Program (HP) crosslisted with a general section (LEY), on \"Bridge to Mathematics\"",
        "extra": "",
        "credit": "3",
        "offered": "fa20",
        "prereqs": "Informal prerequisite: some knowledge of discrete mathematics",
        "schedule": "Not regularly scheduled",
        "title": "Bridge to Mathematics"
    },
    "MATH 4803-LEV": {
        "description": "Special topics course offered in Fall 2018 by Caitlin Leverson on \"Introduction to Knot Theory\"",
        "extra": "",
        "credit": "3",
        "offered": "fa18",
        "prereqs": "MATH 1553, MATH 1554, MATH 1564 or permission from the instructor.",
        "schedule": "Not regularly scheduled",
        "title": "Introduction to Knot Theory"
    },
    "MATH 4803-LIA": {
        "description": "The lectures will focus on an introduction of modern data science techniques and the foundational mathematical concepts in linear algebra, probability, and basic optimization related with these techniques. Sufficient case studies with real-world data sets will be provided to illustrate how to use the learned techniques and how to choose an appropriate model. To gain hands-on experience of analyzing real-world datasets, students will be given programming exercises to practice and improve their programming skills while applying the newly acquired knowledge to those exercises. Homework assignments (assigned during the first 9 weeks) will test students' ability to generalize the techniques covered in each lecture to different examples. Projects will be assigned in Week 10 and students will work in groups of 3-4. The projects will have weekly milestones in weeks 11-14 culminating in a final presentation and report due at the end of the class.",
        "extra": "",
        "credit": "3",
        "offered": "fa19",
        "prereqs": "Calculus I and II: Math 1551 and Math 1552; and Linear algebra, such as 1553 or 1554 or 1564.",
        "schedule": "Not typically scheduled",
        "title": "Science Based Data Science"
    },
    "MATH 4803-MAR": {
        "description": "Special topics course on Geometric Group Theory, offered in Spring 2021 by Dan Margalit.",
        "extra": "",
        "credit": "3",
        "offered": "sp21",
        "prereqs": "MATH 4107 and MATH 2106  or permission of instructor",
        "schedule": "Not regularly scheduled",
        "title": "Geometric Group Theory"
    },
    "MATH 4803-MCC": {
        "description": "Special topics course on Mathematical Capillarity, offered in Spring 2021 by John McCuan.",
        "extra": "",
        "credit": "3",
        "offered": "sp21",
        "prereqs": "No formal prerequisites are required beyond calculus and ODE’s",
        "schedule": "Not regularly scheduled",
        "title": "Mathematical Capillarity"
    },
    "MATH 4803-WAN": {
        "description": "Topics class offered in FALL 2021 by Zhiyu Wang.",
        "extra": "",
        "credit": "3",
        "offered": "fa21",
        "prereqs": "Linear algebra and some familiarity with graph theory",
        "schedule": "Not regularly scheduled",
        "title": "Spectral Graph Theory"
    },
    "MATH 4873": {
        "description": "This is a 2 week intense course, with lectures in the morning and computational lab in the afternoon.\nStudents will be asked to have a laptop with Matlab on it.\n\nThe course will meet in the mornings for lecture, break for  lunch, and reconvene for the lab in the afternoons.",
        "extra": "Undergraduate ODE course like Math 2552.",
        "credit": "3",
        "offered": "su19",
        "prereqs": "Rudiments of Matlab.",
        "schedule": "Not typically scheduled",
        "title": "Computations in Dynamics"
    },
    "MATH 6001": {
        "description": "This course includes topics on professional development and responsible conduct of research. The course satisfies the GT RCR Academic Policy for Doctoral Students to complete in-person RCR training.",
        "extra": "",
        "credit": "2",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "None",
        "schedule": "Every Fall Semester",
        "title": "Introduction to Graduate Mathematics"
    },
    "MATH 6014": {
        "description": "Fundamentals, connectivity, matchings, colorings, extremal problems, Ramsey theory, planar graphs, perfect graphs. Applications to operations research and the design of efficient algorithms.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4022",
        "schedule": "Every fall semester",
        "title": "Graph Theory"
    },
    "MATH 6112": {
        "description": "An advanced course in Linear Algebra and applications.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "Undergraduate linear algebra at the level of MATH 4305, and ability to write rigorous proofs at the level of MATH 2106.",
        "schedule": "Every Fall",
        "title": "Advanced Linear Algebra"
    },
    "MATH 6121": {
        "description": "Graduate level linear and abstract algebra including groups, rings, modules, and fields. (1st of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4107 and one of MATH 2406, MATH 4305, or permission of instructor",
        "schedule": "Every fall semester",
        "title": "Algebra I"
    },
    "MATH 6122": {
        "description": "Graduate level linear and abstract algebra including rings, fields, modules, some algebraic number theory and Galois theory. (2nd of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 6121",
        "schedule": "Every spring semester",
        "title": "Algebra II"
    },
    "MATH 6221": {
        "description": "Classical introduction to probability theory including expectation, notions of convergence, laws of large numbers, independence, large deviations, conditional expectation, martingales and Markov chains.",
        "extra": "",
        "credit": "3",
        "offered": "fa21",
        "prereqs": "MATH 4221 or consent of instructor.",
        "schedule": "Fall starting Fall 21",
        "title": "Advanced Classical Probability Theory"
    },
    "MATH 6235": {
        "description": "This is the second of a two-semester sequence that develops basic probability concepts and models for working with financial markets and derivative securities. Continuous-time parameter stochastic processes are emphasized in this course. Mathematical concepts are introduced as needed.",
        "extra": "",
        "credit": "3",
        "offered": "fa17",
        "prereqs": "MATH 2403, MATH 6759",
        "schedule": "Not regularly scheduled (QCF supported)",
        "title": "Stochastic Processes in Finance II"
    },
    "MATH 6241": {
        "description": "Develops the probability basis requisite in modern statistical theories and stochastic processes. Topics of this course include measure and integration foundations of probability, distribution functions, convergence concepts, laws of large numbers and central limit theory. (1st of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 6337 or equivalent",
        "schedule": "Every fall semester",
        "title": "Probability I"
    },
    "MATH 6242": {
        "description": "Develops the probability basis requisite in modern statistical theories and stochastic processes. (2nd of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 6241 or equivalent",
        "schedule": "Every spring semester",
        "title": "Probability II"
    },
    "MATH 6262": {
        "description": "Basic theories of statistical estimation, including optimal estimation in finite samples and asymptotically optimal estimation. A careful mathematical treatment of the primary techniques of estimation utilized by statisticians.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 4261, MATH 4262 or equivalent and MATH 6241",
        "schedule": "Every spring semester",
        "title": "Statistical Estimation"
    },
    "MATH 6263": {
        "description": "Basic theories of testing statistical hypotheses, including a thorough treatment of testing in exponential class families. A careful mathematical treatment of the primary techniques of hypothesis testing utilized by statisticians.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4261, MATH 4262 or equivalent, MATH 6241 and MATH 6262",
        "schedule": "Every fall semester",
        "title": "Testing Statistical Hypotheses"
    },
    "MATH 6266": {
        "description": "Basic unifying theory underlying techniques of regression, analysis of variance and covariance, from a geometric point of view. Modern computational capabilities are exploited fully. Students apply the theory to real data through canned and coded programs.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4261, MATH 4262 or equivalent and MATH 6241",
        "schedule": "Every fall semester",
        "title": "Linear Statistical Models"
    },
    "MATH 6267": {
        "description": "Multivariate normal distribution theory, correlation and dependence analysis, regression and prediction, dimension-reduction methods, sampling distributions and related inference problems, selected applications in classification theory, multivariate process control, and pattern recognition.",
        "extra": "",
        "credit": "3",
        "offered": "sp20, sp18, sp17, sp16",
        "prereqs": "MATH 4261, MATH 4262 or equivalent and MATH 6241",
        "schedule": "Every even spring semester",
        "title": "Multivariate Statistical Analysis"
    },
    "MATH 6300": {
        "description": "Hausdorff dimension, box counting dimension, iterated function systems, continued fractions, number theory, Julia sets.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 6337",
        "schedule": "Alternate years",
        "title": "Fractal Geometry"
    },
    "MATH 6307": {
        "description": "This sequence develops the qualitative theory for systems of ordinary differential equations. Topics include stability, Lyapunov functions, Floquet theory, attractors, invariant manifolds, bifurcation theory, normal forms. (1st of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4541 and MATH 4542 or permission of the instructor",
        "schedule": "Every fall semester",
        "title": "Ordinary Differential Equations I"
    },
    "MATH 6308": {
        "description": "This sequence develops the qualitative theory for systems of differential equations. Topics include stability, Lyapunov functions, Floquet theory, attractors, invariant manifolds, bifurcation theory, and normal forms. (2nd of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 6307",
        "schedule": "Every spring semester",
        "title": "Ordinary Differential Equations II"
    },
    "MATH 6321": {
        "description": "Complex integration, including Goursat's theorem; classification of singularities, the argument principle, the maximum principle; Riemann Mapping theorem; analytic continuation and Riemann surfaces; range of an analytic function, including Picard's theorem.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 4317 and MATH 4320 or equivalent",
        "schedule": "Every spring semester",
        "title": "Complex Analysis"
    },
    "MATH 6337": {
        "description": "Measure and integration theory",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, fa20, sp20, fa19, sp19, fa18, sp18, fa17, sp17, fa16, sp16",
        "prereqs": "MATH 4318 or consent of the School",
        "schedule": "Every spring and fall semesters",
        "title": "Real Analysis I"
    },
    "MATH 6338": {
        "description": "Topics include L^p, Banach and Hilbert spaces, basic functional analysis.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, su18, sp18, su17, sp17, su16, sp16",
        "prereqs": "MATH 4318 or consent of the school",
        "schedule": "Every spring and some summer semesters",
        "title": "Real Analysis II"
    },
    "MATH 6341": {
        "description": "Introduction to the mathematical theory of partial differential equations covering the basic linear models of science and exact solution techniques.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4318",
        "schedule": "Every fall semester",
        "title": "Partial Differential Equations I"
    },
    "MATH 6342": {
        "description": "This course covers the general mathematical theory of linear stationary and evolution problems plus selected topics chosen on the instructor's interests.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 6341",
        "schedule": "Every spring semester",
        "title": "Partial Differential Equations II"
    },
    "MATH 6421": {
        "description": "The study of zero sets of polynomials: algebraic varieties, regular and rational map, and the Zariski topology.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa19, fa17",
        "prereqs": "MATH 4107 or equivalent",
        "schedule": "Every odd fall",
        "title": "Algebraic Geometry I"
    },
    "MATH 6422": {
        "description": "Continuation of MATH 6421.",
        "extra": "",
        "credit": "3",
        "offered": "sp20, sp18, sp16",
        "prereqs": "MATH 6421",
        "schedule": "Every even spring",
        "title": "Algebraic Geometry II"
    },
    "MATH 6441": {
        "description": "The fundamental group, covering spaces, core topics in homology and cohomology theory including CW complexes, universal coefficients, and Poincare duality.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 4107, MATH 4317 or MATH 4431, or consent of instructor",
        "schedule": "Every Spring Semester",
        "title": "Algebraic Topology I"
    },
    "MATH 6442": {
        "description": "Advanced topics from algebraic topology.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 6441 or equivalent or consent of instructor",
        "schedule": "No regular schedule",
        "title": "Algebraic Topology II"
    },
    "MATH 6451": {
        "description": "Introduction to topological and metric spaces. Continuity, compactness, convergence, completion. Product and quotient spaces. Elementary homotopy.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 4317 or MATH 4431",
        "schedule": "no regular schedule",
        "title": "General Topology"
    },
    "MATH 6452": {
        "description": "The differential topology of smooth manifolds.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4431",
        "schedule": "Every Fall Semester",
        "title": "Differential Topology"
    },
    "MATH 6453": {
        "description": "Continuation of MATH 6452, complementary to MATH 6441, MATH 6442, MATH 6455, MATH 6456, MATH 6421, MATH 6422.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 6425 or MATH 6441 or MATH 6455",
        "schedule": "No regular schedule",
        "title": "Geometric Topology"
    },
    "MATH 6455": {
        "description": "Core topics in differential and Riemannian geometry including Lie groups, curvature, relations with topology.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 4441 or MATH 6452 or permission of the instructor.",
        "schedule": "Every Spring Semester",
        "title": "Differential Geometry I"
    },
    "MATH 6514": {
        "description": "Applied mathematics techniques to solve real-world problems. Topics include mathematical modeling, asymptotic analysis, differential equations and scientific computation. Prepares the student for MATH 6515. (1st of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 2403 or MATH 2602, MATH 4640",
        "schedule": "Every fall semester",
        "title": "Industrial Mathematics I"
    },
    "MATH 6515": {
        "description": "Applications of mathematical techniques from MATH 6514 to solve real-world problems. Group projects to solve industrial problems in topics chosen by the instructor. (2nd of two courses)",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 6514",
        "schedule": "Not currently offered",
        "title": "Industrial Mathematics II"
    },
    "MATH 6580": {
        "description": "Geometry, convergence, and structure of linear operators in infinite dimensional spaces. Applications to science and engineering, including integral equations and ordinary and partial differential equations.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, su18, fa17, su17, fa16, su16",
        "prereqs": "MATH 2403 and one of MATH 2406, MATH 4305",
        "schedule": "Every fall semester and some summers",
        "title": "Introduction to Hilbert Spaces"
    },
    "MATH 6583": {
        "description": "Volterra and Fredholm linear integral equations, relation to differential equations, solution methods, Fourier, Laplace and Mellin transforms, applications to boundary value problems and integral equations.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 6701 or MATH 2403 and one of MATH 2406 or MATH 4305",
        "schedule": "Not currently offered",
        "title": "Integral Equations and Transforms"
    },
    "MATH 6635": {
        "description": "This course contains the basic numerical and simulation techniques for the pricing of derivative securities.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 2403 and MATH 3215 (or the equivalent), knowledge of computer programming, and MS QCF standing or some previous exposure to the topics of stocks, bonds and options.",
        "schedule": "Every spring semester",
        "title": "Numerical Methods in Finance"
    },
    "MATH 6640": {
        "description": "Introduction to the implementation and analysis of numerical algorithms for the numerical solution of the classic partial differential equations of science and engineering.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 4347 and MATH 4640",
        "schedule": "Every fall semester",
        "title": "Introduction to Numerical Methods for Partial Differential Equations"
    },
    "MATH 6641": {
        "description": "Analysis and implementation of numerical methods for nonlinear partial differential equations including elliptic, hyperbolic, and/or parabolic problems.",
        "extra": "",
        "credit": "3",
        "offered": "sp20, sp18, sp16",
        "prereqs": "MATH 6640",
        "schedule": "Every even spring",
        "title": "Advanced Numerical Methods for Partial Differential Equations"
    },
    "MATH 6643": {
        "description": "Introduction to the numerical solution of the classic problems of linear algebra including linear systems, least squares, SVD, eigenvalue problems. Crosslisted with CSE 6643.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 2406 or MATH 4305 or consent of School",
        "schedule": "Every fall (MATH) and spring (CSE)",
        "title": "Numerical Linear Algebra"
    },
    "MATH 6644": {
        "description": "Iterative methods for linear and nonlinear systems of equations including Jacobi, G-S, SOR, CG, multigrid, fixed point methods, Newton quasi-Newton, updating, gradient methods. Crosslisted with CSE 6644.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 2406 or MATH 4305 or consent of School",
        "schedule": "Every spring (MATH) and fall (CSE)",
        "title": "Iterative Methods for Systems of Equations"
    },
    "MATH 6645": {
        "description": "Theoretical and computational aspects of polynomial, rational, trigonometric, spline and wavelet approximation.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp19, sp17",
        "prereqs": "MATH 4317 and MATH 4640",
        "schedule": "Every odd spring",
        "title": "Numerical Approximation Theory"
    },
    "MATH 6646": {
        "description": "Analysis and implementation of numerical methods for initial and two point boundary value problems for ordinary differential equations.",
        "extra": "",
        "credit": "3",
        "offered": "sp20, sp18, sp16",
        "prereqs": "MATH 2403 and MATH 4640",
        "schedule": "Every even spring semester",
        "title": "Numerical Methods for Ordinary Differential Equations"
    },
    "MATH 6647": {
        "description": "Approximation of the dynamical structure of a differential equation and preservation of dynamical structure under discretization.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp19, sp17",
        "prereqs": "MATH 4640 and MATH 4641",
        "schedule": "Every odd spring semester",
        "title": "Numerical Methods for Dynamical Systems"
    },
    "MATH 6701": {
        "description": "Review of linear algebra and ordinary differential equations, brief introduction to functions of a complex variable.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, su21, fa20, su20, fa19, su19, fa18, su18, fa17, su17, fa16, su16",
        "prereqs": "MATH 2406 or MATH 4305, and MATH 2403",
        "schedule": "Every summer and fall semesters",
        "title": "Math Methods of Applied Sciences I"
    },
    "MATH 6702": {
        "description": "Review of vector calculus and and its application to partial differential equations.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 6701, or MATH 2403 and one of MATH 2406, MATH 4305",
        "schedule": "Every spring semester",
        "title": "Math Methods of Applied Sciences II"
    },
    "MATH 6705": {
        "description": "Mathematical methods for solving problems in the life sciences. Models-based course on basic facts from the theory of ordinary differential equations and numerical methods of their solution. Introduction to the control theory, diffusion theory, maximization, minimization and curve fitting.",
        "extra": "",
        "credit": "3",
        "offered": "fa20, fa19, fa18, fa17, fa16",
        "prereqs": "RESTRICTED to biology, bioinformatics, biomedical engineering, bioengineering, and chemistry students. Graduate students in other majors cannot take this course. Math majors may not use this course toward any degree in the School of Mathematics.",
        "schedule": "Usually Every fall semester",
        "title": "Modeling and Dynamics"
    },
    "MATH 6759": {
        "description": "Mathematical modeling of financial markets, derivative securities pricing, and portfolio optimization. Concepts from probability and mathematics are introduced as needed. Crosslisted with ISYE 6759.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 3215 and some knowledge of computer programming",
        "schedule": "Every fall semester (ISyE)",
        "title": "Stochastic Processes in Finance I"
    },
    "MATH 6761": {
        "description": "Discrete time Markov chains, Poisson processes and renewal processes. Transient and limiting behavior. Average cost and utility measures of systems. Algorithm for computing performance measures. Modeling of inventories, and flows in manufacturing and computer networks. (Also listed as ISyE 6761)",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 3215 or equivalent",
        "schedule": "Every fall semester",
        "title": "Stochastic Processes I"
    },
    "MATH 6762": {
        "description": "Continuous time Markov chains. Uniformization, transient and limiting behavior. Brownian motion and martingales. Optional sampling and convergence. Modeling of inventories, finance, flows in manufacturing and computer networks. (Also listed as ISyE 6762)",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 6761",
        "schedule": "Every spring semester",
        "title": "Stochastic Processes II"
    },
    "MATH 6767": {
        "description": "Introduction to large scale-system design to support computational finance for options, stocks, or other instruments.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH XXXX",
        "schedule": "Every fall semester",
        "title": "Design and Implementation of Systems to Support Computational Finance"
    },
    "MATH 6769": {
        "description": "Description, institutional features, and mathematical modeling of fixed income securities. Use of both deterministic and stochastic models. Crosslisted with ISYE 6769.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 3215 and (MGT 6060 or MGT 6078)",
        "schedule": "Every spring semester",
        "title": "Fixed Income Securities"
    },
    "MATH 6781": {
        "description": "Reliability systems and related distributions, failure rate functions and nonparametric classes, accelerated life testing, dependent failure analysis, statistical inference of reliability data. (Also listed as ISyE 6781)",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 3215 or equivalent",
        "schedule": "Last offered in 2014",
        "title": "Reliability Theory"
    },
    "MATH 6783": {
        "description": "Fundamentals of statistical inference are presented and developed for models used in the modern analysis of financial data. Techniques are motivated by examples and developed in the context of applications. Crosslisted with ISYE 6783.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 3215 (or equivalent), some knowledge of programming, and MS QCF standing or some previous exposure to the topics of stocks, bonds and options",
        "schedule": "Every spring semester",
        "title": "Statistical Techniques of Financial Data Analysis"
    },
    "MATH 6785": {
        "description": "Case studies, visiting lecturers from financial institutions, student group projects of an advanced nature, and student reports, all centered around quantitative and computational finance. Crosslisted with ISYE and MGT 6785.",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MS QCF major or consent of the instructor",
        "schedule": "Every fall semester",
        "title": "The Practice of Quantitative and Computational Finance"
    },
    "MATH 7012": {
        "description": "Fundamental methods of enumeration and asymptotic analysis, including the use of inclusion/exclusion, generating functions, and recurrence relations. Applications to strings over a finite alphabet and graphs.",
        "extra": "",
        "credit": "3",
        "offered": "fa20, fa17",
        "prereqs": "MATH 4032 or permission of instructor",
        "schedule": "Usually every odd Fall",
        "title": "Enumerative Combinatorics"
    },
    "MATH 7014": {
        "description": "Selection of topics vary with each offering.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp19, sp18, sp17, sp16",
        "prereqs": "None",
        "schedule": "Usually every spring semester",
        "title": "Advanced Graph Theory"
    },
    "MATH 7016": {
        "description": "Fundamental combinatorial structures including hypergraphs, transversal sets, colorings, Sperner families, intersecting families, packings and coverings, perfect graphs, and Ramsey theory. Algebraic and topological methods, applications.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 4022 or consent of the School",
        "schedule": "Not currently offered",
        "title": "Combinatorics"
    },
    "MATH 7018": {
        "description": "Applications of probabilistic techniques in discrete mathematics, including classical ideas using expectation and variance as well as modern tools, such as martingale and correlation inequalities.",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 4022 and MATH 6221 or consent of School",
        "schedule": "Every Spring Semester",
        "title": "Probabilistic Methods in Combinatorics"
    },
    "MATH 7244": {
        "description": "An introduction to the Ito stochastic calculus and stochastic differential equations through a development of continuous-time martingales and Markov processes. (1st of two courses in sequence)",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa20, fa19, fa18, fa17, fa16",
        "prereqs": "MATH 6242 or equivalent",
        "schedule": "Every fall semester",
        "title": "Stochastic Processes and Stochastic Calculus I"
    },
    "MATH 7245": {
        "description": "An introduction to the Ito stochastic calculus and stochastic differential equations through a development of continuous-time martingales and Markov processes. (2nd of two courses in sequence)",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp20, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 7244 or equivalent",
        "schedule": "Every spring semester",
        "title": "Stochastic Processes and Stochastic Calculus II"
    },
    "MATH 7251": {
        "description": "The goal of this PhD level graduate course is to provide a rigorous introduction to the methods of high-dimensional probability.",
        "extra": "",
        "credit": "3",
        "offered": "sp21",
        "prereqs": "MATH 6241",
        "schedule": "Every Spring starting Sp 2021",
        "title": "High-dimensional probability"
    },
    "MATH 7252": {
        "description": "The goal of this PhD level graduate course is to provide a rigorous introduction to concepts and methods of high-dimensional statistics\nhaving numerous applications in machine learning, data science and signal processing.",
        "extra": "",
        "credit": "3",
        "offered": "fa21",
        "prereqs": "MATH 6241, MATH 7251",
        "schedule": "Starting Fa 21 every Fall",
        "title": "High-Dimensional Statistics"
    },
    "MATH 7334": {
        "description": "Theory of linear operators on Hilbert space; spectral theory of bounded and unbounded operators; applications",
        "extra": "",
        "credit": "3",
        "offered": "sp21, sp19, sp18, sp17, sp16",
        "prereqs": "MATH 6337",
        "schedule": "Usually every spring semester",
        "title": "Introduction to Operator Theory"
    },
    "MATH 7337": {
        "description": "Fourier analysis in Euclidean space. Basic topics including L^1 and L^2 theory; advanced topics such as distribution theory, uncertainty, Littlewood-Paley theory",
        "extra": "",
        "credit": "3",
        "offered": "fa21, fa19, fa17",
        "prereqs": "MATH 6337",
        "schedule": "Every odd fall semester",
        "title": "Harmonic Analysis"
    },
    "MATH 7338": {
        "description": "Topics include the Hahn-Banach theorems, the Baire Category theorem and its consequences, duality in Banach spaces, locally convex spaces, additional topics.",
        "extra": "",
        "credit": "3",
        "offered": "fa20, fa18, fa16",
        "prereqs": "MATH 6337 or MATH 6338",
        "schedule": "Every even fall semester",
        "title": "Functional Analysis"
    },
    "MATH 7510": {
        "description": "Algorithms for graph problems such as maximum flow, matching, network reliability, minimum cuts, covering, coloring, planarity, shortest paths, and connectivity. Crosslisted with CS 7510 and ISYE 7510.",
        "extra": "",
        "credit": "3",
        "offered": "fa19",
        "prereqs": "CS6505 or CS6550",
        "schedule": "Not regularly scheduled",
        "title": "Graph Algorithms"
    },
    "MATH 7581": {
        "description": "Minimization of functionals, Euler Lagrange equations, sufficient conditions for a minimum, geodesic, isoperimetric and time of transit problems, variational principles of mechanics, applications to control theory.",
        "extra": "",
        "credit": "3",
        "offered": "sp20, sp18, sp16",
        "prereqs": "MATH 4317 or equivalent",
        "schedule": "Every even spring",
        "title": "Calculus of Variations"
    },
    "MATH 7586": {
        "description": "Review of linear algebra, multilinear algebra, algebra of tensors, co- and cotravariant tensors, tensors in Riemann spaces, geometrical interpretation of skew tensors.",
        "extra": "",
        "credit": "3",
        "offered": "Not currently offered",
        "prereqs": "MATH 2403 and either MATH 2406 or MATH 4305",
        "schedule": "no regular schedule",
        "title": "Tensor Analysis"
    },
    "MATH 8801": {
        "description": "Seminar series in which different groups within the College of Sciences will give talks about how their research\nrelates to data sciences and machine learning.",
        "extra": "",
        "credit": "1",
        "offered": "fa21",
        "prereqs": "None.",
        "schedule": "Not regularly scheduled",
        "title": "Seminar in Data Sciences"
    },
    "MATH 8801-BUR": {
        "description": "Special topics course on The Academic and Industry Job Search in Mathematics offered in Fall 2018 by Morag Burke.",
        "extra": "",
        "credit": "1",
        "offered": "fa18",
        "prereqs": "This course is for international PhD students in Math who are nearing the completion of their degree, and are preparing to go on the job market.",
        "schedule": "Not regularly scheduled",
        "title": "The Academic and Industry Job Search in Mathematics"
    },
    "MATH 8803 HOU": {
        "description": "Special Topics course offered in Spring 2017 by Christian Houdre.",
        "extra": "",
        "credit": "3",
        "offered": "sp17",
        "prereqs": "Strong knowledge of Probability Theory at the level of MATH 7244",
        "schedule": "no regular schedule",
        "title": "Asymptotics in Sequence Comparison"
    },
    "MATH 8803 POP": {
        "description": "Special topics on Introduction to Random Matrices offered in Spring 2016 by Ionel Popescu.",
        "extra": "",
        "credit": "3",
        "offered": "sp16",
        "prereqs": "MATH XXXX",
        "schedule": "no regular schedule",
        "title": "Introduction to Random Matrices"
    },
    "MATH 8803 TAO": {
        "description": "Special topics on Applied Stochastic Dynamics offered in Spring 2016 by Molei Tao.",
        "extra": "",
        "credit": "3",
        "offered": "sp16",
        "prereqs": "MATH 2552, MATH 4347, MATH 3215",
        "schedule": "no regular schedule",
        "title": "Applied Stochastic Dynamics"
    },
    "MATH 8803-BAK": {
        "description": "Special topics course on Topics in Matroid Theory, offered in Fall 2020 by Matt Baker.",
        "extra": "",
        "credit": "3",
        "offered": "fa20",
        "prereqs": "MATH 6121 . Some background in graph theory, at the level of MATH 6014, would also be helpful.",
        "schedule": "Not regularly scheduled",
        "title": "Topics in Matroid Theory"
    },
    "MATH 8803-BEA": {
        "description": "Special topics course on Algebraic Topology, offered in Fall 2020 by Jonathan Beardsley.",
        "extra": "",
        "credit": "3",
        "offered": "fa20",
        "prereqs": "MATH 6441",
        "schedule": "Not regularly scheduled",
        "title": "Topics in Algebraic Topology"
    },
    "MATH 8803-BER": {
        "description": "Topics class offered in FALL 2021 by Anton Bernshteyn.",
        "extra": "",
        "credit": "3",
        "offered": "fa21",
        "prereqs": "Knowledge of the fundamentals of graph theory will be assumed, as well as some basic familiarity with measure theory and point-set topology (although the necessary background from these areas will be reviewed in the course). No prior knowledge of descriptive set theory is required.",
        "schedule": "Not regularly scheduled",
        "title": "Descriptive Combinatorics"
    },
    "MATH 8803-BLO": {
        "description": "Special topics course on Topological Quantum Computing/Quantum Representations, offered in Spring 2021 by Wade Bloomquist.",
        "extra": "",
        "credit": "3",
        "offered": "sp21",
        "prereqs": "An effort will be made to make this course accessible to as broad of an audience as possible. The following topics could be considered a rough list of prerequisite concepts:Topology of surfaces (for example isotopy of curves); Group theory; Linear algebra",
        "schedule": "Not regularly scheduled",
        "title": "Introduction to Topological Quantum Computing/Quantum Representations"
    },
    "MATH 8803-BUR": {
        "description": "Special topics course on The Academic and Industry Job Search offered in Fall 2017 by Morag Burke.",
        "extra": "",
        "credit": "3",
        "offered": "fa17",
        "prereqs": "None",
        "schedule": "Not regularly scheduled",
        "title": "The Academic and Industry Job Search"
    },
    "MATH 8803-DAM": {
        "description": "Special Topics course offered in Fall 2020 by Michael Damron.",
        "extra": "",
        "credit": "3",
        "offered": "fa20",
        "prereqs": "MATH 6241 , MATH 6242",
        "schedule": "Not regularly scheduled",
        "title": "Percolation Models"
    },
    "MATH 8803-ETN": {
        "description": "Topics class offered in FALL 2021 by John Etnyre.",
        "extra": "",
        "credit": "3",
        "offered": "fa21",
        "prereqs": "MATH 6452, MATH 6441 (though students without these courses still might be able to take the course-- they should talk to Dr. Etnyre about it).",
        "schedule": "Not regularly scheduled",
        "title": "The topology of 3-manifolds"
    },
    "MATH 8803-FAT": {
        "description": "None.",
        "extra": "",
        "credit": "0",
        "offered": "sp19",
        "prereqs": "Math 6337 (Real Analysis I) Math 6338 (Real Analysis II)  Math Ordinary Differential Equations I",
        "schedule": "Not typically scheduled",
        "title": "Weak KAM Theorem: Lagrangian Dynamics and viscosity solutions of PDEs"
    },
    "MATH 8803-GHO": {
        "description": "None.",
        "extra": "",
        "credit": "3",
        "offered": "fa19",
        "prereqs": "Interest in geometry or its potential applications, together with mathematical maturity at the level of a beginning math grad student. There will be no specific course requirements; however, some familiarity with differential geometry (e.g., Math 6455) or manifold theory (e.g., Math 6452) could be helpful. Advanced undergraduate students with some knowledge of classical differential geometry of curves and surfaces (e.g., Math 4441) may also take this class.",
        "schedule": "Not typically scheduled",
        "title": "Isometric Embeddings"
    },
    "MATH 8803-HEI": {
        "description": "Topics class offered in Spring 2020 by Christine Heitsch.",
        "extra": "",
        "credit": "3",
        "offered": "sp20",
        "prereqs": "This class is aimed at Graduate students in bioinformatics, biomedical engineering, bioengineering, and quantitative biosciences (except those in SoM).",
        "schedule": "Not regularly scheduled",
        "title": "Fundamentals of Discrete Mathematical Biology"
    },
    "MATH 8803-HOM": {
        "description": "Special topics course on Introduction to Heegaard Floer homology offered in Fall 2017 by Jennifer Hom.",
        "extra": "",
        "credit": "3",
        "offered": "fa17",
        "prereqs": "MATH 6441, Algebraic Topology I",
        "schedule": "Not regularly scheduled",
        "title": "Introduction to Heegaard Floer homology"
    },
    "MATH 8803-KOL": {
        "description": "None.",
        "extra": "",
        "credit": "3",
        "offered": "sp19",
        "prereqs": "An advanced probability course (ideally, at the level 6241)",
        "schedule": "Not typically scheduled",
        "title": "Topics in High-Dimensional Statistics"
    },
    "MATH 8803-LAC": {
        "description": "Special topics course on Mathematical Introduction to Compressive Sensing, by Michael Lacey, offered Fall 2016.",
        "extra": "",
        "credit": "3",
        "offered": "fa16",
        "prereqs": "MATH 4305 and familiarity with Gaussian random variables and stochastic processes",
        "schedule": "no regular schedule",
        "title": "Mathematical Introduction to Compressive Sensing"
    },
    "MATH 8803-LAM": {
        "description": "Special Topics course offered in Spring 2018 by Peter Lambert-Cole on \"4-Manifolds\".",
        "extra": "",
        "credit": "3",
        "offered": "sp18",
        "prereqs": "MATH 6441",
        "schedule": "Not regularly scheduled",
        "title": "4-manifolds"
    },
    "MATH 8803-LIN": {
        "description": "Special topics course offered in Fall 2018 by Zhiwu Lin on \"Dynamics of Hamiltonian PDEs.\"",
        "extra": "",
        "credit": "3",
        "offered": "fa18",
        "prereqs": "TBA",
        "schedule": "Not typically scheduled",
        "title": "Dynamics of Hamiltonian PDEs"
    },
    "MATH 8803-LIV": {
        "description": "Special topics course on \"High-dimensional geometry and probability\" offered in Spring 2018 by Galyna Livshyts.",
        "extra": "",
        "credit": "3",
        "offered": "sp18",
        "prereqs": "No prerequisites aside from Calculus I-III and an introduction to undergraduate Probability Theory",
        "schedule": "Not regularly scheduled",
        "title": "High-dimensional geometry and probability"
    },
    "MATH 8803-LUB": {
        "description": "Special topics course on Potential Theory offered by Doron Lubinsky in Fall 2016",
        "extra": "",
        "credit": "3",
        "offered": "fa16",
        "prereqs": "MATH 6337",
        "schedule": "no regular schedule",
        "title": "Potential Theory"
    },
    "MATH 8803-MAR": {
        "description": "Special topics course on Mapping Class Groups, offered in Fall 2020 by Dan Margalit.",
        "extra": "",
        "credit": "3",
        "offered": "fa20",
        "prereqs": "MATH 6121, MATH 6441",
        "schedule": "Not regularly scheduled",
        "title": "Mapping Class Groups"
    },
    "MATH 8803-MAT": {
        "description": "Special topics course offered in Spring 2018 by Henry Matzinger on \"Big matrices and real life machine learning applied problems\"",
        "extra": "",
        "credit": "3",
        "offered": "sp18",
        "prereqs": "TBA",
        "schedule": "Not regularly scheduled",
        "title": "Big matrices and real life machine learning applied  problems"
    },
    "MATH 8803-MCC": {
        "description": "Special topics course on Mathematical Capillarity, offered in Spring 2021 by John McCuan.",
        "extra": "",
        "credit": "3",
        "offered": "sp21",
        "prereqs": "No formal prerequisites are required beyond calculus and ODE’s",
        "schedule": "Not regularly scheduled",
        "title": "Mathematical Capillarity"
    },
    "MATH 8803-PHD": {
        "description": "Pass/Fail only. A course for graduate students in Mathematics to help prepare for the written comprehensive exams in Algebra and Analysis. Offered Summer 2017.\nIn 2017, the course was split into two sections: MATH 8802 ALG and MATH 8802 ANA.",
        "extra": "",
        "credit": "3",
        "offered": "su17, su18, su19",
        "prereqs": "Knowledge of Abstract Algebra and/or Real Analysis at the level of our graduate coursework. Restricted to Graduate students in Mathematics.",
        "schedule": "Every summer",
        "title": "Mathematics Written Comps Preparatory Class"
    },
    "MATH 8803-RAE": {
        "description": "Special topics course offered in Summer 2018 by Christopher Heil and Shahaf Nitzan on \"Real Analysis for Engineers\".\nThis course can be taken in place of MATH 6337, Real Analysis, to satisfy the prerequisite for MATH 6241, Probability I.\nThis course cannot be used for credit at the same time as MATH 6337.",
        "extra": "",
        "credit": "3",
        "offered": "su18",
        "prereqs": "MATH 4317",
        "schedule": "Not regularly scheduled",
        "title": "Real Analysis for Engineers"
    },
    "MATH 8803-ROL": {
        "description": "Special Topics course offered in Spring 2018 by Larry Rolen on \"Modular Forms: Theory and Applications\"",
        "extra": "",
        "credit": "3",
        "offered": "sp18",
        "prereqs": "MATH 4320 Complex Analysis",
        "schedule": "Not regularly scheduled",
        "title": "Modular Forms: Theory and Applications"
    },
    "MATH 8803-SIN": {
        "description": "Special topics course on Algebraic Curves, offered in Fall 2016 by Rainer Sinn.",
        "extra": "",
        "credit": "3",
        "offered": "fa16",
        "prereqs": "MATH 6121",
        "schedule": "no regular schedule",
        "title": "Algebraic Curves"
    },
    "MATH 8803-STR": {
        "description": "None.",
        "extra": "",
        "credit": "3",
        "offered": "sp19",
        "prereqs": "Differential topology (Math 6452) or permission of the instructor. Familiarity with some basics (Riemannian metrics and geodesics) from Differential Geometry I (Math 6455) is also recommended.",
        "schedule": "Not typically scheduled",
        "title": "Geometric structures on surfaces"
    },
    "MATH 8803-WAN": {
        "description": "Topics class offered in FALL 2021 by Zhiyu Wang.",
        "extra": "",
        "credit": "3",
        "offered": "fa21",
        "prereqs": "Linear algebra and some familiarity with graph theory",
        "schedule": "Not regularly scheduled",
        "title": "Spectral Graph Theory"
    },
    "MATH 8803-WAR": {
        "description": "Special topics  course on Random Discrete Structures, offered in Fall 2017 by Lutz Warnke.",
        "extra": "",
        "credit": "3",
        "offered": "fa17",
        "prereqs": "Math 6221 (Advanced Classical Probability Theory) or Math 7018 (Probabilistic Methods in Combinatorics) or Math 6241 (Probability I).",
        "schedule": "Not regularly scheduled",
        "title": "Random Discrete Structures"
    },
    "MATH 8873": {
        "description": "This is a 2 week intense course, with lectures in the morning and computational lab in the afternoon.\nStudents will be asked to have a laptop with Matlab on it.\n\nThe course will meet in the mornings for lecture, break for  lunch, and reconvene for the lab in the afternoons.",
        "extra": "Undergraduate ODE course like Math 2552.",
        "credit": "3",
        "offered": "su19",
        "prereqs": "Rudiments of Matlab.",
        "schedule": "Not typically scheduled",
        "title": "Computations in Dynamics"
    }
}
